//
//  Macros.h
//  dqxTailor
//
//  Created by HANSHAOWEN on 16/11/23.
//  Copyright © 2016年 mengyoutu.cn. All rights reserved.
//

#ifndef Macros_h
#define Macros_h

#pragma mark - UI / 屏幕、控件尺寸

#define kKeyWindow [UIApplication sharedApplication].keyWindow

#define isRetina                  ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 960), [[UIScreen mainScreen] currentMode].size) : NO)
#define isPad                     (UI_USER_INTERFACE_IDIOM() == UIUserInterfaceIdiomPad)
#define BottomEdgeYOfView(view)   view.frame.origin.y + view.frame.size.height
// 屏幕高度
#define SCREEN_HEIGHT             [[UIScreen mainScreen] bounds].size.height
// 屏幕宽度
#define SCREEN_WIDTH              [[UIScreen mainScreen] bounds].size.width
#define FULL_WIDTH                SCREEN_WIDTH
#define FULL_HEIGHT               (SCREEN_HEIGHT - ((SYSTEM_VERSION >= 7) ? 0 : STATUSBAR_HEIGHT))
#define CONTENT_HEIGHT            (FULL_HEIGHT - NAVBAR_HEIGHT)

#define Device_Is_iPhone5         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 1136), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(750, 1334), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6Plus     ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(1242, 2208), [[UIScreen mainScreen] currentMode].size) : NO)

#define DEVICE_UUID               [[[UIDevice currentDevice] identifierForVendor] UUIDString]

#define KEYBOARD_HEIGHT           216

// 字体
#pragma mark - font
#define FontWithNameSize(name, size)    [UIFont fontWithName:name size:size]
#define FontWithSize(size)              [UIFont systemFontOfSize:size]
#define ScoreFontWithSize(fontSize)     [UIFont fontWithName:@"Bradley Hand" size:fontSize]
#define BoldFontWithSize(size)          [UIFont boldSystemFontOfSize:size]
#define BoldSystemFont(size)            [UIFont boldSystemFontOfSize:size]
#define systemFont(size)                [UIFont systemFontOfSize:size]

#pragma mark - GCD
// 单例
#define DISPATCH_ONCE_BLOCK(onceBlock); static dispatch_once_t onceToken; dispatch_once(&onceToken, onceBlock);

// 是否为中文
#define IS_CH_SYMBOL(chr)               ((int)(chr)>127)
#define StringByTrimWhiteSpace(text)    [text stringByTrimmingCharactersInSet:[NSCharacterSet whitespaceAndNewlineCharacterSet]]
#define IsStringEmpty(string)           (!string || [@"" isEqualToString:string])
#define IsStringNotEmpty(string)        (string && ![@"" isEqualToString:string])

#define ISNULL(x) (x?((id)x==(id)[NSNull null]):true)

//详细的数据
//裁缝－防具配方
#define RECIPT_SECTION5_1               @[@"裁缝入门", @"暖场艺人", @"新手艺人", @"剪柳", @"治愈", @"射手", @"丝织", @"藏红花", @"药师", @"初级魔法战士", @"修炼", @"舞者", @"闪避", @"学者", @"疾风", @"魔术师", @"功夫", @"树叶", @"斗牛士", @"咒术师", @"守护", @"西部", @"神官", @"森人", @"拳法", @"讲述者", @"魔导士", @"祭司", @"神圣", @"水之羽衣", @"击剑士", @"奇术师", @"混混", @"占星术士", @"圣者", @"真理", @"知识", @"大师", @"财宝", @"月之长袍", @"原始兽", @"拳圣", @"摩登兔", @"王宫魔术师", @"小丑", @"古代魔术", @"奇迹", @"古武道", @"大魔导", @"大贤者", @"追击者", @"偶像", @"求道者", @"作曲家", @"领悟", @"台风", @"羊之衣", @"舞台", @"暗鸦", @"退魔", @"古代王族", @"圣贤者", @"黄龙"]
#define RECIPT_SECTION5_1_SUB			@[@[@"皮帽", @"亚麻短裤", @"亚麻帽", @"皮手套", @"皮铠", @"亚麻手套", @"亚麻衣服", @"皮鞋", @"皮裤", @"亚麻鞋"],\
										@[@"暖场艺人方头巾", @"暖场艺人手环", @"暖场艺人衣服", @"暖场艺人长靴", @"暖场艺人长裤"],\
										@[@"新手艺人方头巾", @"新手艺人长靴", @"新手艺人长裤", @"新手艺人手套", @"新手艺人的衣服"],\
										@[@"剪柳头巾", @"剪柳鞋", @"剪柳紧身裤", @"剪柳手环", @"剪柳衣服"],\
										@[@"治愈帽", @"治愈长靴", @"治愈长裤", @"治愈衣服"],\
										@[@"射手帽", @"射手鞋", @"射手紧身裤", @"射手手套", @"射手衣服"],\
										@[@"丝织帽", @"丝织凉鞋", @"丝织长袍下装", @"丝织长袍上装"],\
										@[@"藏红花帽", @"藏红花长靴", @"藏红花长袍下装", @"藏红花手套", @"藏红花长袍上装"],\
										@[@"药师帽", @"药师鞋", @"药师长袍下装", @"药师长袍上装"],\
										@[@"初级魔法战士贝雷帽", @"初级魔法战士鞋", @"初级魔法战士紧身裤", @"初级魔法战士手套", @"初级魔法战士服"],\
										@[@"修炼头带", @"修炼长靴", @"修炼服下装", @"修炼护腕", @"修炼服上装"],\
										@[@"舞者头带", @"舞者鞋", @"舞者喇叭裤", @"舞者护腕", @"舞者衬衫"],\
										@[@"闪避帽", @"闪避之靴", @"闪避之衣下装", @"闪避之衣上装"],\
										@[@"学者帽", @"学者脚带", @"学者衣服下装", @"学者衣服上装"],\
										@[@"疾风头巾", @"疾风手套", @"疾风背心", @"疾风长靴", @"疾风马裤"],\
										@[@"魔术师头带", @"魔术师短靴", @"魔术师紧身裤", @"魔术师手套", @"魔术师衣服"],\
										@[@"功夫小帽", @"功夫鞋", @"功夫长裤", @"功夫护腕", @"功夫上衣"],\
										@[@"树叶帽", @"树叶长靴", @"树叶铠甲下装", @"树叶手环", @"树叶铠甲上装"],\
										@[@"斗牛士头带", @"斗牛士鞋", @"斗牛士衣服下装", @"斗牛士衣服上装", @"斗牛士手套"],\
										@[@"咒术师长头巾", @"咒术师鞋", @"咒术师长袍下装", @"咒术师长袍上装"],\
										@[@"守护帽", @"守护鞋", @"守护长袍"],\
										@[@"西部帽", @"西部长靴", @"西部短裤", @"西部手套", @"西部衬衫"],\
										@[@"神官帽", @"神官鞋", @"神官法衣下装", @"神官手套", @"神官法衣上装"],\
										@[@"森人帽", @"森人长靴", @"森人围裙", @"森人手套", @"森人背心"],\
										@[@"拳法脚带", @"拳法衣服下装", @"拳法腕带", @"拳法衣服上装"],\
										@[@"讲述者帽", @"讲述者长靴", @"讲述者衣服下装", @"讲述者手套", @"讲述者衣服上装"],\
										@[@"魔导士帽", @"魔导士鞋", @"魔导士衣服下装", @"魔导士衣服上装"],\
										@[@"祭司帽", @"祭司长靴", @"祭司手套", @"祭司法衣"],\
										@[@"神圣帽", @"神圣长靴", @"神圣长袍下装", @"神圣长袍上装"],\
										@[@"水之冠", @"水之脚带", @"水之羽衣下装", @"水之羽衣上装"],\
										@[@"击剑士帽", @"击剑士长靴", @"击剑士手环", @"击剑士披风"],\
										@[@"奇术师帽", @"奇术师长靴", @"奇术师裤子", @"奇术师手套", @"奇术师衣服"],\
										@[@"混混方头巾", @"混混背心", @"混混裤子", @"混混手环", @"混混长靴"],\
										@[@"占星术士长头巾", @"占星术士长靴", @"占星术士长袍下装", @"占星术士长袍上装"],\
										@[@"圣者帽", @"圣者手套", @"圣者长靴", @"圣者法衣"],\
										@[@"真理帽", @"真理长袍上装", @"真理长袍下装", @"真理鞋"],\
										@[@"知识帽子", @"知识凉鞋", @"知识长袍下装", @"知识长袍上装"],\
										@[@"大师帽", @"大师马甲", @"大师长裤", @"大师护腕", @"大师鞋"],\
										@[@"财宝帽", @"财宝手套", @"财宝长靴", @"财宝外衣下装", @"财宝外衣上装"],\
										@[@"月之冠", @"月之鞋", @"月之长袍上装", @"月之长袍下装"],\
										@[@"原始兽毛皮帽", @"原始兽长靴", @"原始兽外衣上装", @"原始兽外衣下装", @"原始兽手套"],\
										@[@"拳圣长头巾", @"拳圣鞋", @"拳圣道衣上装", @"拳圣道衣下装", @"拳圣手环"],\
										@[@"摩登兔发饰", @"摩登兔鞋", @"摩登兔上衣", @"摩登兔紧身裤", @"摩登兔荷叶裙", @"摩登兔手镯"],\
										@[@"王宫魔术师帽", @"王宫魔术师长袍上装", @"王宫魔术师长袍下装", @"王宫魔术师鞋"],\
										@[@"小丑帽", @"小丑背心", @"小丑长裤", @"小丑手套", @"小丑鞋"],\
										@[@"古代魔术帽", @"古代魔术手环", @"古代魔术法衣上装", @"古代魔术法衣下装", @"古代魔术长靴"],\
										@[@"奇迹帽", @"奇迹外衣上装", @"奇迹外衣下装", @"奇迹手套", @"奇迹靴子"],\
										@[@"古武道头巾", @"古武道衣服上装", @"古武道衣服下装", @"古武道手环", @"古武道长靴"],\
										@[@"大魔导帽", @"大魔导长袍上装", @"大魔导长袍下装", @"大魔导手环", @"大魔导鞋"],\
										@[@"大贤者僧帽", @"大贤者法衣", @"大贤者手套", @"大贤者鞋"],\
										@[@"追击者头带", @"追击者皮衣上装", @"追击者皮衣下装", @"追击者护手", @"追击者长靴"],\
										@[@"偶像头带", @"偶像衣服上装", @"偶像衣服下装", @"偶像手镯", @"偶像长靴"],\
										@[@"求道者头带", @"求道者道衣上装", @"求道者道衣下装", @"求道者手套", @"求道者长靴"],\
										@[@"作曲家头带", @"作曲家衣服上装", @"作曲家衣服下装", @"作曲家手镯", @"作曲家脚带"],\
										@[@"领悟头冠", @"领悟衣服", @"领悟手套", @"领悟长靴"],\
										@[@"台风护目镜", @"台风皮衣上装", @"台风皮衣下装", @"台风手套", @"台风长靴"],\
										@[@"羊之兜帽", @"羊之衣上装", @"羊之衣下装", @"羊之手套", @"羊之鞋"],\
										@[@"舞台头带", @"舞台芭蕾裙下装", @"舞台缎带", @"舞台护腕", @"舞台上衣", @"舞台护臂", @"舞台芭蕾裙上装", @"舞台鞋", @"舞台短裤", @"舞台长靴"],\
										@[@"暗鸦帽", @"暗鸦战衣", @"暗鸦护手", @"暗鸦靴"],\
										@[@"退魔帽", @"退魔法衣上装", @"退魔法衣下装", @"退魔手环", @"退魔鞋"],\
										@[@"古代王族长头巾", @"古代王族背心", @"古代王族裤子", @"古代王族护臂", @"古代王族靴"],\
										@[@"圣贤者僧帽", @"圣贤者长袍上装", @"圣贤者长袍下装", @"圣贤者护臂", @"圣贤者鞋"],\
										@[@"黄龙头带", @"黄龙手环", @"黄龙道衣", @"黄龙鞋"]]
#define RECIPT_SECTION5_1_SUB_IMAGE		@[@[@"Icon-皮帽", @"Icon-亚麻短裤", @"Icon-亚麻帽", @"Icon-皮手套", @"Icon-皮铠", @"Icon-亚麻手套", @"Icon-亚麻衣服", @"Icon-皮鞋", @"Icon-皮裤", @"Icon-亚麻鞋"],\
										@[@"Icon-暖场艺人方头巾", @"Icon-暖场艺人手环", @"Icon-暖场艺人衣服", @"Icon-暖场艺人长靴", @"Icon-暖场艺人长裤"],\
										@[@"Icon-新手艺人方头巾", @"Icon-新手艺人长靴", @"Icon-新手艺人长裤", @"Icon-新手艺人手套", @"Icon-新手艺人的衣服"],\
										@[@"Icon-剪柳头巾", @"Icon-剪柳鞋", @"Icon-剪柳紧身裤", @"Icon-剪柳手环", @"Icon-剪柳衣服"],\
										@[@"Icon-治愈帽", @"Icon-治愈长靴", @"Icon-治愈长裤", @"Icon-治愈衣服"],\
										@[@"Icon-射手帽", @"Icon-射手鞋", @"Icon-射手紧身裤", @"Icon-射手手套", @"Icon-射手衣服"],\
										@[@"Icon-丝织帽", @"Icon-丝织凉鞋", @"Icon-丝织长袍下装", @"Icon-丝织长袍上装"],\
										@[@"Icon-藏红花帽", @"Icon-藏红花长靴", @"Icon-藏红花长袍下装", @"Icon-藏红花手套", @"Icon-藏红花长袍上装"],\
										@[@"Icon-药师帽", @"Icon-药师鞋", @"Icon-药师长袍下装", @"Icon-药师长袍上装"],\
										@[@"Icon-初级魔法战士贝雷帽", @"Icon-初级魔法战士鞋", @"Icon-初级魔法战士紧身裤", @"Icon-初级魔法战士手套", @"Icon-初级魔法战士服"],\
										@[@"Icon-修炼头带", @"Icon-修炼长靴", @"Icon-修炼服下装", @"Icon-修炼护腕", @"Icon-修炼服上装"],\
										@[@"Icon-舞者头带", @"Icon-舞者鞋", @"Icon-舞者喇叭裤", @"Icon-舞者护腕", @"Icon-舞者衬衫"],\
										@[@"Icon-闪避帽", @"Icon-闪避之靴", @"Icon-闪避之衣下装", @"Icon-闪避之衣上装"],\
										@[@"Icon-学者帽", @"Icon-学者脚带", @"Icon-学者衣服下装", @"Icon-学者衣服上装"],\
										@[@"Icon-疾风头巾", @"Icon-疾风手套", @"Icon-疾风背心", @"Icon-疾风长靴", @"Icon-疾风马裤"],\
										@[@"Icon-魔术师头带", @"Icon-魔术师短靴", @"Icon-魔术师紧身裤", @"Icon-魔术师手套", @"Icon-魔术师衣服"],\
										@[@"Icon-功夫小帽", @"Icon-功夫鞋", @"Icon-功夫长裤", @"Icon-功夫护腕", @"Icon-功夫上衣"],\
										@[@"Icon-树叶帽", @"Icon-树叶长靴", @"Icon-树叶铠甲下装", @"Icon-树叶手环", @"Icon-树叶铠甲上装"],\
										@[@"Icon-斗牛士头带", @"Icon-斗牛士鞋", @"Icon-斗牛士衣服下装", @"Icon-斗牛士衣服上装", @"Icon-斗牛士手套"],\
										@[@"Icon-咒术师长头巾", @"Icon-咒术师鞋", @"Icon-咒术师长袍下装", @"Icon-咒术师长袍上装"],\
										@[@"Icon-守护帽", @"Icon-守护鞋", @"Icon-守护长袍"],\
										@[@"Icon-西部帽", @"Icon-西部长靴", @"Icon-西部短裤", @"Icon-西部手套", @"Icon-西部衬衫"],\
										@[@"Icon-神官帽", @"Icon-神官鞋", @"Icon-神官法衣下装", @"Icon-神官手套", @"Icon-神官法衣上装"],\
										@[@"Icon-森人帽", @"Icon-森人长靴", @"Icon-森人围裙", @"Icon-森人手套", @"Icon-森人背心"],\
										@[@"Icon-拳法脚带", @"Icon-拳法衣服下装", @"Icon-拳法腕带", @"Icon-拳法衣服上装"],\
										@[@"Icon-讲述者帽", @"Icon-讲述者长靴", @"Icon-讲述者衣服下装", @"Icon-讲述者手套", @"Icon-讲述者衣服上装"],\
										@[@"Icon-魔导士帽", @"Icon-魔导士鞋", @"Icon-魔导士衣服下装", @"Icon-魔导士衣服上装"],\
										@[@"Icon-祭司帽", @"Icon-祭司长靴", @"Icon-祭司手套", @"Icon-祭司法衣"],\
										@[@"Icon-神圣帽", @"Icon-神圣长靴", @"Icon-神圣长袍下装", @"Icon-神圣长袍上装"],\
										@[@"Icon-水之冠", @"Icon-水之脚带", @"Icon-水之羽衣下装", @"Icon-水之羽衣上装"],\
										@[@"Icon-击剑士帽", @"Icon-击剑士长靴", @"Icon-击剑士手环", @"Icon-击剑士披风"],\
										@[@"Icon-奇术师帽", @"Icon-奇术师长靴", @"Icon-奇术师裤子", @"Icon-奇术师手套", @"Icon-奇术师衣服"],\
										@[@"Icon-混混方头巾", @"Icon-混混背心", @"Icon-混混裤子", @"Icon-混混手环", @"Icon-混混长靴"],\
										@[@"Icon-占星术士长头巾", @"Icon-占星术士长靴", @"Icon-占星术士长袍下装", @"Icon-占星术士长袍上装"],\
										@[@"Icon-圣者帽", @"Icon-圣者手套", @"Icon-圣者长靴", @"Icon-圣者法衣"],\
										@[@"Icon-真理帽", @"Icon-真理长袍上装", @"Icon-真理长袍下装", @"Icon-真理鞋"],\
										@[@"Icon-知识帽子", @"Icon-知识凉鞋", @"Icon-知识长袍下装", @"Icon-知识长袍上装"],\
										@[@"Icon-大师帽", @"Icon-大师马甲", @"Icon-大师长裤", @"Icon-大师护腕", @"Icon-大师鞋"],\
										@[@"Icon-财宝帽", @"Icon-财宝手套", @"Icon-财宝长靴", @"Icon-财宝外衣下装", @"Icon-财宝外衣上装"],\
										@[@"Icon-月之冠", @"Icon-月之鞋", @"Icon-月之长袍上装", @"Icon-月之长袍下装"],\
										@[@"Icon-原始兽毛皮帽", @"Icon-原始兽长靴", @"Icon-原始兽外衣上装", @"Icon-原始兽外衣下装", @"Icon-原始兽手套"],\
										@[@"Icon-拳圣长头巾", @"Icon-拳圣鞋", @"Icon-拳圣道衣上装", @"Icon-拳圣道衣下装", @"Icon-拳圣手环"],\
										@[@"Icon-摩登兔发饰", @"Icon-摩登兔鞋", @"Icon-摩登兔上衣", @"Icon-摩登兔紧身裤", @"Icon-摩登兔荷叶裙", @"Icon-摩登兔手镯"],\
										@[@"Icon-王宫魔术师帽", @"Icon-王宫魔术师长袍上装", @"Icon-王宫魔术师长袍下装", @"Icon-王宫魔术师鞋"],\
										@[@"Icon-小丑帽", @"Icon-小丑背心", @"Icon-小丑长裤", @"Icon-小丑手套", @"Icon-小丑鞋"],\
										@[@"Icon-古代魔术帽", @"Icon-古代魔术手环", @"Icon-古代魔术法衣上装", @"Icon-古代魔术法衣下装", @"Icon-古代魔术长靴"],\
										@[@"Icon-奇迹帽", @"Icon-奇迹外衣上装", @"Icon-奇迹外衣下装", @"Icon-奇迹手套", @"Icon-奇迹靴子"],\
										@[@"Icon-古武道头巾", @"Icon-古武道衣服上装", @"Icon-古武道衣服下装", @"Icon-古武道手环", @"Icon-古武道长靴"],\
										@[@"Icon-大魔导帽", @"Icon-大魔导长袍上装", @"Icon-大魔导长袍下装", @"Icon-大魔导手环", @"Icon-大魔导鞋"],\
										@[@"Icon-大贤者僧帽", @"Icon-大贤者法衣", @"Icon-大贤者手套", @"Icon-大贤者鞋"],\
										@[@"Icon-追击者头带", @"Icon-追击者皮衣上装", @"Icon-追击者皮衣下装", @"Icon-追击者护手", @"Icon-追击者长靴"],\
										@[@"Icon-偶像头带", @"Icon-偶像衣服上装", @"Icon-偶像衣服下装", @"Icon-偶像手镯", @"Icon-偶像长靴"],\
										@[@"Icon-求道者头带", @"Icon-求道者道衣上装", @"Icon-求道者道衣下装", @"Icon-求道者手套", @"Icon-求道者长靴"],\
										@[@"Icon-作曲家头带", @"Icon-作曲家衣服上装", @"Icon-作曲家衣服下装", @"Icon-作曲家手镯", @"Icon-作曲家脚带"],\
										@[@"Icon-领悟头冠", @"Icon-领悟衣服", @"Icon-领悟手套", @"Icon-领悟长靴"],\
										@[@"Icon-台风护目镜", @"Icon-台风皮衣上装", @"Icon-台风皮衣下装", @"Icon-台风手套", @"Icon-台风长靴"],\
										@[@"Icon-羊之兜帽", @"Icon-羊之衣上装", @"Icon-羊之衣下装", @"Icon-羊之手套", @"Icon-羊之鞋"],\
										@[@"Icon-舞台头带", @"Icon-舞台芭蕾裙下装", @"Icon-舞台缎带", @"Icon-舞台护腕", @"Icon-舞台上衣", @"Icon-舞台护臂", @"Icon-舞台芭蕾裙上装", @"Icon-舞台鞋", @"Icon-舞台短裤", @"Icon-舞台长靴"],\
										@[@"Icon-暗鸦帽", @"Icon-暗鸦战衣", @"Icon-暗鸦护手", @"Icon-暗鸦靴"],\
										@[@"Icon-退魔帽", @"Icon-退魔法衣上装", @"Icon-退魔法衣下装", @"Icon-退魔手环", @"Icon-退魔鞋"],\
										@[@"Icon-古代王族长头巾", @"Icon-古代王族背心", @"Icon-古代王族裤子", @"Icon-古代王族护臂", @"Icon-古代王族靴"],\
										@[@"Icon-圣贤者僧帽", @"Icon-圣贤者长袍上装", @"Icon-圣贤者长袍下装", @"Icon-圣贤者护臂", @"Icon-圣贤者鞋"],\
										@[@"Icon-黄龙头带", @"Icon-黄龙手环", @"Icon-黄龙道衣", @"Icon-黄龙鞋"]]
//裁缝－家具配方
#define RECIPT_SECTION5_2               @[@"家具配方"]
#define RECIPT_SECTION5_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION5_2_SUB_IMAGE		@[@[@""]]


//配方详细数据
#define RECIPT_DETAIL @"野兽原皮,1,麻线,1,0,0,0,0,0,0",@"皮帽",\
@"麻线,3,0,0,0,0,0,0,0,0",@"暖场艺人方头巾",\
@"麻线,3,0,0,0,0,0,0,0,0",@"亚麻帽",\
@"麻线,3,木棉草,2,0,0,0,0,0,0",@"新手艺人方头巾",\
@"麻线,3,丝草,1,0,0,0,0,0,0",@"剪柳头巾",\
@"麻线,3,花蜜,1,0,0,0,0,0,0",@"治愈帽",\
@"丝草,2,木棉草,1,0,0,0,0,0,0",@"丝织帽",\
@"木棉草,3,绿苔,3,0,0,0,0,0,0",@"射手帽",\
@"木棉草,3,麻线,2,0,0,0,0,0,0",@"修炼头带",\
@"木棉草,3,花蜜,1,0,0,0,0,0,0",@"藏红花帽",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师帽",\
@"木棉草,3,斩风羽,1,0,0,0,0,0,0",@"初级魔法战士贝雷帽",\
@"木棉草,3,彩虹色的布片,3,0,0,0,0,0,0",@"舞者头带",\
@"木棉草,4,海风草,1,0,0,0,0,0,0",@"疾风头巾",\
@"木棉草,4,普库兰藏红花,1,0,0,0,0,0,0",@"闪避帽",\
@"木棉草,4,小块原骨,2,0,0,0,0,0,0",@"魔术师头带",\
@"木棉草,4,领悟草,4,0,0,0,0,0,0",@"学者帽",\
@"丝草,4,野兽原皮,2,红浆果,1,0,0,0,0",@"功夫小帽",\
@"丝草,4,草原之水,2,小块原骨,2,0,0,0,0",@"斗牛士头带",\
@"丝草,4,沙漠水果,1,领悟草,1,0,0,0,0",@"咒术师长头巾",\
@"丝草,5,坚硬的胡桃,2,花蜜,1,0,0,0,0",@"守护帽",\
@"丝草,4,魔兽原皮,2,野兽原皮,5,0,0,0,0",@"西部帽",\
@"丝草,4,草原木头,2,埃尔托纳水仙,2,0,0,0,0",@"树叶帽",\
@"丝草,5,普库兰藏红花,1,天籁之蜜,2,雨露之丝,2,0,0",@"讲述者帽",\
@"丝草,5,净化之水,3,白色珍珠,1,雨露之丝,2,0,0",@"神官帽",\
@"丝草,5,美丽蘑菇,3,蝴蝶翅膀,2,雨露之丝,2,0,0",@"魔导士帽",\
@"丝草,5,浓密毛皮,4,小块原骨,3,雨露之丝,2,0,0",@"森人帽",\
@"闪光草,6,海风草,3,绿苔,3,雨露之丝,3,0,0",@"击剑士帽",\
@"闪光草,6,蓝色之眼,1,金属碎片,1,雨露之丝,3,0,0",@"水之冠",\
@"闪光草,6,草原之水,2,沙漠水果,1,雨露之丝,3,0,0",@"奇术师帽",\
@"闪光草,6,绿色宝石,1,神奇海草,2,雨露之丝,3,0,0",@"祭司帽",\
@"闪光草,6,红浆果,3,柔软的羊毛,1,雨露之丝,3,0,0",@"神圣帽",\
@"闪光草,12,魔兽原皮,16,蓝色宝珠,2,雨露之丝,12,0,0",@"真理帽",\
@"闪光草,12,蝙蝠翅膀,16,紫色宝珠,2,雨露之丝,12,0,0",@"大师帽",\
@"闪光草,12,海风草,30,黄色宝珠,2,雨露之丝,12,0,0",@"混混方头巾",\
@"闪光草,16,星之碎片,24,紫色宝珠,2,雨露之丝,12,0,0",@"占星术士长头巾",\
@"闪光草,16,光之石,24,绿色宝珠,2,雨露之丝,12,0,0",@"圣者帽",\
@"闪光草,16,蝙蝠翅膀,24,红色宝珠,2,雨露之丝,12,0,0",@"财宝帽",\
@"闪光草,16,七色茧,24,蓝色宝珠,2,雨露之丝,12,0,0",@"知识帽子",\
@"彩虹色的布片,20,满月草,40,汗与泪的结晶,15,紫色宝珠,3,雨露之丝,16",@"月之冠",\
@"闪避草,20,脏绷带,40,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"拳圣长头巾",\
@"浓密毛皮,20,龙的原皮,1,汗与泪的结晶,15,绿色宝珠,3,雨露之丝,16",@"原始兽毛皮帽",\
@"妖异草,20,柔软的羊毛,4,汗与泪的结晶,15,绿色宝珠,3,雨露之丝,16",@"摩登兔发饰",\
@"脏绷带,20,野兽原皮,40,汗与泪的结晶,15,红色宝珠,3,雨露之丝,16",@"古武道头巾",\
@"妖异草,20,夜之幕,3,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"王宫魔术师帽",\
@"彩虹色的布片,20,光之石,16,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"小丑帽",\
@"彩虹色的布片,20,浓密毛皮,40,汗与泪的结晶,15,蓝色宝珠,3,雨露之丝,16",@"奇迹帽",\
@"浓密毛皮,20,小块原骨,40,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"古代魔术帽",\
@"海风草,30,武道精华,6,汗与泪的结晶,20,绿色宝珠,4,雨露之丝,20",@"求道者头带",\
@"蝙蝠翅膀,30,夜之幕,2,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"大魔导帽",\
@"野兽原皮,30,金属碎片,1,汗与泪的结晶,20,黄色宝珠,4,雨露之丝,20",@"追击者头带",\
@"领悟草,30,浓密毛皮,50,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"大贤者僧帽",\
@"浓密毛皮,30,金属碎片,1,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"偶像头带",\
@"彩虹色的布片,30,斩风羽,5,汗与泪的结晶,20,紫色宝珠,4,雨露之丝,20",@"作曲家头带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"羊之兜帽",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"领悟头冠",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"舞台头带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"舞台缎带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"台风护目镜",\
@"妖精的棉花,36,史莱姆时尚花,24,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,36",@"退魔帽",\
@"妖精的棉花,36,蝙蝠翅膀,64,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,36",@"暗鸦帽",\
@"妖精的棉花,36,幻兽原皮,4,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"圣贤者僧帽",\
@"妖精的棉花,36,武道精华,12,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"黄龙头带",\
@"妖精的棉花,36,斩风羽,12,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"古代王族长头巾",\
@"野兽原皮,1,麻线,1,0,0,0,0,0,0",@"皮铠",\
@"野兽原皮,2,0,0,0,0,0,0,0,0",@"暖场艺人衣服",\
@"麻线,3,0,0,0,0,0,0,0,0",@"亚麻衣服",\
@"麻线,3,红浆果,3,0,0,0,0,0,0",@"新手艺人的衣服",\
@"麻线,3,丝草,1,0,0,0,0,0,0",@"剪柳衣服",\
@"麻线,3,净化之水,1,0,0,0,0,0,0",@"治愈衣服",\
@"丝草,2,海风草,1,0,0,0,0,0,0",@"丝织长袍上装",\
@"木棉草,3,美丽蘑菇,4,0,0,0,0,0,0",@"射手衣服",\
@"木棉草,3,净化之水,2,0,0,0,0,0,0",@"修炼服上装",\
@"木棉草,3,草原之水,1,0,0,0,0,0,0",@"藏红花长袍上装",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师长袍上装",\
@"木棉草,3,妖异草,3,0,0,0,0,0,0",@"初级魔法战士服",\
@"木棉草,3,红浆果,6,0,0,0,0,0,0",@"舞者衬衫",\
@"木棉草,4,沙漠水果,2,0,0,0,0,0,0",@"疾风背心",\
@"木棉草,4,闪避草,2,0,0,0,0,0,0",@"闪避之衣上装",\
@"木棉草,5,野兽原皮,2,0,0,0,0,0,0",@"魔术师衣服",\
@"木棉草,5,美丽蘑菇,5,0,0,0,0,0,0",@"学者衣服上装",\
@"丝草,5,武道精华,1,绿苔,1,0,0,0,0",@"功夫上衣",\
@"丝草,5,麻线,2,红色宝石,1,0,0,0,0",@"斗牛士衣服上装",\
@"丝草,5,草原之水,2,埃尔托纳水仙,1,0,0,0,0",@"咒术师长袍上装",\
@"丝草,5,坚硬的胡桃,2,净化之水,1,0,0,0,0",@"守护长袍",\
@"丝草,5,绿色之眼,2,绿苔,4,0,0,0,0",@"西部衬衫",\
@"丝草,5,药草,30,绿色宝石,1,0,0,0,0",@"树叶铠甲上装",\
@"丝草,5,武道精华,1,海风草,2,雨露之丝,3,0,0",@"拳法衣服上装",\
@"丝草,5,领悟草,1,天籁之蜜,2,雨露之丝,3,0,0",@"讲述者衣服上装",\
@"丝草,5,净化之水,3,精灵石,1,雨露之丝,3,0,0",@"神官法衣上装",\
@"丝草,5,美丽蘑菇,3,蝙蝠翅膀,2,雨露之丝,3,0,0",@"魔导士衣服上装",\
@"丝草,5,坚硬的胡桃,4,大块原骨,4,雨露之丝,3,0,0",@"森人背心",\
@"闪光草,6,绿色之眼,2,普库兰藏红花,3,雨露之丝,4,0,0",@"击剑士披风",\
@"闪光草,6,时之水晶,1,天使的神酒,1,雨露之丝,4,0,0",@"水之羽衣上装",\
@"闪光草,6,红色之眼,2,沙漠水果,1,雨露之丝,4,0,0",@"奇术师衣服",\
@"闪光草,6,黄色之眼,2,精灵石,1,雨露之丝,4,0,0",@"祭司法衣",\
@"闪光草,6,黄色之眼,2,柔软的羊毛,1,雨露之丝,4,0,0",@"神圣长袍上装",\
@"闪光草,16,柔软的羊毛,40,蓝色宝珠,3,雨露之丝,16,0,0",@"真理长袍上装",\
@"闪光草,16,夜之幕,6,紫色宝珠,3,雨露之丝,16,0,0",@"大师马甲",\
@"闪光草,16,神奇海草,60,黄色宝珠,3,雨露之丝,16,0,0",@"混混背心",\
@"闪光草,20,星之碎片,30,紫色宝珠,3,雨露之丝,16,0,0",@"占星术士长袍上装",\
@"闪光草,20,光之石,30,绿色宝珠,3,雨露之丝,16,0,0",@"圣者法衣",\
@"闪光草,20,蝙蝠翅膀,30,红色宝珠,3,雨露之丝,16,0,0",@"财宝外衣上装",\
@"闪光草,20,七色茧,30,蓝色宝珠,3,雨露之丝,16,0,0",@"知识长袍上装",\
@"彩虹色的布片,24,涟漪之露,50,汗与泪的结晶,25,紫色宝珠,4,雨露之丝,20",@"月之长袍上装",\
@"闪避草,24,天使的神酒,1,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"拳圣道衣上装",\
@"浓密毛皮,24,大鳞片,50,汗与泪的结晶,25,绿色宝珠,4,雨露之丝,20",@"原始兽外衣上装",\
@"妖异草,24,蝴蝶翅膀,50,汗与泪的结晶,25,绿色宝珠,4,雨露之丝,20",@"摩登兔上衣",\
@"脏绷带,24,武道精华,4,汗与泪的结晶,25,红色宝珠,4,雨露之丝,20",@"古武道衣服上装",\
@"妖异草,24,神奇海草,50,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"王宫魔术师长袍上装",\
@"彩虹色的布片,24,美丽蘑菇,30,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"小丑背心",\
@"彩虹色的布片,24,龙的原皮,2,汗与泪的结晶,25,蓝色宝珠,4,雨露之丝,20",@"奇迹外衣上装",\
@"浓密毛皮,24,时之水晶,1,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"古代魔术法衣上装",\
@"海风草,36,绿苔,60,汗与泪的结晶,30,绿色宝珠,6,雨露之丝,24",@"求道者道衣上装",\
@"蝙蝠翅膀,36,彩虹色的布片,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"大魔导长袍上装",\
@"野兽原皮,36,魔兽原皮,16,汗与泪的结晶,30,黄色宝珠,6,雨露之丝,24",@"追击者皮衣上装",\
@"领悟草,36,史莱姆果冻,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"大贤者法衣",\
@"浓密毛皮,36,小贝壳,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"偶像衣服上装",\
@"彩虹色的布片,36,蛇蜕,50,汗与泪的结晶,30,紫色宝珠,6,雨露之丝,24",@"作曲家衣服上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"羊之衣上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"领悟衣服",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"舞台上衣",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"舞台芭蕾裙上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"台风皮衣上装",\
@"妖精的棉花,48,闪避草,80,汗与泪的结晶,45,彩虹宝珠,4,雨露之丝,44",@"退魔法衣上装",\
@"妖精的棉花,48,脏绷带,80,汗与泪的结晶,45,彩虹宝珠,4,雨露之丝,44",@"暗鸦战衣",\
@"妖精的棉花,48,圣者之灰,16,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"圣贤者长袍上装",\
@"妖精的棉花,48,龙的原骨,8,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"黄龙道衣",\
@"妖精的棉花,48,妖异草,80,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"古代王族背心",\
@"丝草,4,祈晴竹叶,12,0,0,0,0,0,0",@"星天之衣",\
@"妖异草,4,繁星的眼泪,12,0,0,0,0,0,0",@"繁星衣服",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮裤",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"暖场艺人长裤",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻短裤",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"新手艺人长裤",\
@"麻线,2,丝草,1,0,0,0,0,0,0",@"剪柳紧身裤",\
@"麻线,2,净化之水,1,0,0,0,0,0,0",@"治愈长裤",\
@"丝草,1,海风草,1,0,0,0,0,0,0",@"丝织长袍下装",\
@"木棉草,2,草原之水,3,0,0,0,0,0,0",@"射手紧身裤",\
@"木棉草,2,丝草,1,0,0,0,0,0,0",@"修炼服下装",\
@"木棉草,2,草原之水,1,0,0,0,0,0,0",@"藏红花长袍下装",\
@"木棉草,2,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师长袍下装",\
@"木棉草,2,绿苔,3,0,0,0,0,0,0",@"初级魔法战士紧身裤",\
@"木棉草,2,神奇海草,6,0,0,0,0,0,0",@"舞者喇叭裤",\
@"木棉草,3,海风草,1,0,0,0,0,0,0",@"疾风马裤",\
@"木棉草,3,花蜜,1,0,0,0,0,0,0",@"闪避之衣下装",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"魔术师紧身裤",\
@"木棉草,3,浓密毛皮,3,0,0,0,0,0,0",@"学者衣服下装",\
@"丝草,3,草原之水,2,埃尔托纳水仙,1,0,0,0,0",@"功夫长裤",\
@"丝草,3,闪避草,1,埃尔托纳水仙,1,0,0,0,0",@"斗牛士衣服下装",\
@"丝草,3,美丽蘑菇,1,领悟草,1,0,0,0,0",@"咒术师长袍下装",\
@"丝草,3,闪避草,4,蛇蜕,2,0,0,0,0",@"西部短裤",\
@"丝草,3,闪避草,2,天籁之蜜,1,0,0,0,0",@"树叶铠甲下装",\
@"丝草,4,闪避草,1,海风草,2,雨露之丝,1,0,0",@"拳法衣服下装",\
@"丝草,4,彩虹色的布片,1,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者衣服下装",\
@"丝草,4,净化之水,3,绿苔,2,雨露之丝,1,0,0",@"神官法衣下装",\
@"丝草,4,美丽蘑菇,3,魔兽原皮,1,雨露之丝,1,0,0",@"魔导士衣服下装",\
@"丝草,4,彩虹色的布片,2,小块原骨,3,雨露之丝,1,0,0",@"森人围裙",\
@"闪光草,5,精灵石,3,涟漪之露,3,雨露之丝,2,0,0",@"水之羽衣下装",\
@"闪光草,5,魔兽原皮,2,沙漠水果,1,雨露之丝,2,0,0",@"奇术师裤子",\
@"闪光草,5,精灵石,1,净化之水,3,雨露之丝,2,0,0",@"神圣长袍下装",\
@"闪光草,10,浓密毛皮,40,蓝色宝珠,2,雨露之丝,10,0,0",@"真理长袍下装",\
@"闪光草,10,神奇海草,40,紫色宝珠,2,雨露之丝,10,0,0",@"大师长裤",\
@"闪光草,10,彩虹色的布片,40,黄色宝珠,2,雨露之丝,10,0,0",@"混混裤子",\
@"闪光草,12,星之碎片,18,紫色宝珠,2,雨露之丝,10,0,0",@"占星术士长袍下装",\
@"闪光草,12,蝙蝠翅膀,18,红色宝珠,2,雨露之丝,10,0,0",@"财宝外衣下装",\
@"闪光草,12,七色茧,18,蓝色宝珠,2,雨露之丝,10,0,0",@"知识长袍下装",\
@"彩虹色的布片,16,满月草,30,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"月之长袍下装",\
@"闪避草,16,野兽原皮,30,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"拳圣道衣下装",\
@"浓密毛皮,16,小鳞片,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"原始兽外衣下装",\
@"妖异草,16,樱花花瓣,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"摩登兔紧身裤",\
@"妖异草,16,樱花花瓣,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"摩登兔荷叶裙",\
@"脏绷带,16,浓密毛皮,35,汗与泪的结晶,10,红色宝珠,3,雨露之丝,12",@"古武道衣服下装",\
@"妖异草,16,黑珍珠,8,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"王宫魔术师长袍下装",\
@"彩虹色的布片,16,蝴蝶翅膀,24,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"小丑长裤",\
@"彩虹色的布片,16,红浆果,24,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"奇迹外衣下装",\
@"浓密毛皮,16,神奇海草,30,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"古代魔术法衣下装",\
@"海风草,24,闪避草,50,汗与泪的结晶,15,绿色宝珠,4,雨露之丝,16",@"求道者道衣下装",\
@"蝙蝠翅膀,24,夜之幕,1,汗与泪的结晶,15,蓝色宝珠,4,雨露之丝,16",@"大魔导长袍下装",\
@"野兽原皮,24,魔兽原皮,12,汗与泪的结晶,15,黄色宝珠,4,雨露之丝,16",@"追击者皮衣下装",\
@"浓密毛皮,24,精灵石,2,汗与泪的结晶,15,蓝色宝珠,4,雨露之丝,16",@"偶像衣服下装",\
@"彩虹色的布片,24,樱花花瓣,50,汗与泪的结晶,15,紫色宝珠,4,雨露之丝,16",@"作曲家衣服下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"羊之衣下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"舞台短裤",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"舞台芭蕾裙下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"台风皮衣下装",\
@"妖精的棉花,32,彩虹色的布片,72,汗与泪的结晶,30,彩虹宝珠,3,雨露之丝,28",@"退魔法衣下装",\
@"妖精的棉花,32,史莱姆果冻,80,汗与泪的结晶,50,彩虹宝珠,4,雨露之丝,32",@"圣贤者长袍下装",\
@"妖精的棉花,32,镜之石,32,汗与泪的结晶,50,彩虹宝珠,4,雨露之丝,32",@"古代王族裤子",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮手套",\
@"麻线,2,0,0,0,0,0,0,0,0",@"暖场艺人手环",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻手套",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"新手艺人手套",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"剪柳手环",\
@"木棉草,2,浓密毛皮,2,0,0,0,0,0,0",@"射手手套",\
@"木棉草,2,神奇海草,1,0,0,0,0,0,0",@"修炼护腕",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"藏红花手套",\
@"木棉草,2,大贝壳,2,0,0,0,0,0,0",@"初级魔法战士手套",\
@"木棉草,2,美丽蘑菇,6,0,0,0,0,0,0",@"舞者护腕",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"疾风手套",\
@"木棉草,2,浓密毛皮,1,0,0,0,0,0,0",@"魔术师手套",\
@"丝草,2,麻线,2,神奇海草,1,0,0,0,0",@"功夫护腕",\
@"丝草,2,大贝壳,2,野兽原皮,1,0,0,0,0",@"斗牛士手套",\
@"丝草,2,沙漠水果,2,野兽原皮,2,0,0,0,0",@"西部手套",\
@"丝草,2,绿苔,3,草原木头,2,0,0,0,0",@"树叶手环",\
@"丝草,3,武道精华,1,拳骨菇,2,雨露之丝,1,0,0",@"拳法腕带",\
@"丝草,3,浓密毛皮,2,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者手套",\
@"丝草,3,净化之水,3,黑珍珠,1,雨露之丝,1,0,0",@"神官手套",\
@"丝草,3,美丽蘑菇,4,小块原骨,2,雨露之丝,1,0,0",@"森人手套",\
@"闪光草,4,龙的原皮,1,绿苔,3,雨露之丝,2,0,0",@"击剑士手环",\
@"闪光草,4,闪避草,1,沙漠水果,1,雨露之丝,2,0,0",@"奇术师手套",\
@"闪光草,5,领悟草,2,万年雪,3,雨露之丝,2,0,0",@"祭司手套",\
@"闪光草,8,纯白木头,10,紫色宝珠,1,雨露之丝,8,0,0",@"大师护腕",\
@"闪光草,8,红珊瑚,36,黄色宝珠,1,雨露之丝,8,0,0",@"混混手环",\
@"闪光草,10,光之石,12,绿色宝珠,1,雨露之丝,8,0,0",@"圣者手套",\
@"闪光草,10,蝙蝠翅膀,12,红色宝珠,1,雨露之丝,8,0,0",@"财宝手套",\
@"闪避草,12,武道精华,4,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"拳圣手环",\
@"浓密毛皮,12,大块原骨,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"原始兽手套",\
@"妖异草,12,蛇蜕,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"摩登兔手镯",\
@"脏绷带,12,武道精华,2,汗与泪的结晶,5,红色宝珠,2,雨露之丝,10",@"古武道手环",\
@"彩虹色的布片,12,野兽原皮,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"小丑手套",\
@"彩虹色的布片,12,柔软的羊毛,2,汗与泪的结晶,5,蓝色宝珠,2,雨露之丝,10",@"奇迹手套",\
@"浓密毛皮,12,小贝壳,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"古代魔术手环",\
@"海风草,18,脏绷带,40,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"求道者手套",\
@"蝙蝠翅膀,18,妖异草,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大魔导手环",\
@"野兽原皮,18,龙的原皮,2,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"追击者护手",\
@"领悟草,18,史莱姆果冻,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大贤者手套",\
@"浓密毛皮,18,万年雪,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"偶像手镯",\
@"彩虹色的布片,18,魔兽原骨,5,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"作曲家手镯",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"羊之手套",\
@"幻兽原皮,2,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"领悟手套",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台护腕",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台护臂",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"台风手套",\
@"妖精的棉花,24,幻兽原骨,4,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"退魔手环",\
@"妖精的棉花,24,斩风羽,8,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"暗鸦护手",\
@"妖精的棉花,24,光之石,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"圣贤者护臂",\
@"妖精的棉花,24,星之碎片,70,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"黄龙手环",\
@"妖精的棉花,24,魔法树木,24,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"古代王族护臂",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮鞋",\
@"麻线,2,0,0,0,0,0,0,0,0",@"暖场艺人长靴",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻鞋",\
@"麻线,2,红浆果,1,0,0,0,0,0,0",@"新手艺人长靴",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"剪柳鞋",\
@"麻线,2,纯白木头,1,0,0,0,0,0,0",@"治愈长靴",\
@"丝草,1,麻线,1,0,0,0,0,0,0",@"丝织凉鞋",\
@"木棉草,2,野兽原皮,2,0,0,0,0,0,0",@"射手鞋",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"修炼长靴",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"藏红花长靴",\
@"木棉草,2,绿苔,1,0,0,0,0,0,0",@"药师鞋",\
@"木棉草,2,野兽原皮,2,0,0,0,0,0,0",@"初级魔法战士鞋",\
@"木棉草,2,小贝壳,6,0,0,0,0,0,0",@"舞者鞋",\
@"木棉草,2,草原木头,1,0,0,0,0,0,0",@"疾风长靴",\
@"木棉草,2,领悟草,1,0,0,0,0,0,0",@"闪避之靴",\
@"木棉草,2,领悟草,1,0,0,0,0,0,0",@"魔术师短靴",\
@"木棉草,2,魔力之土,2,0,0,0,0,0,0",@"学者脚带",\
@"丝草,2,草原木头,1,闪避草,1,0,0,0,0",@"功夫鞋",\
@"丝草,2,纯白木头,1,维纳尔贝壳,1,0,0,0,0",@"斗牛士鞋",\
@"丝草,2,沙漠水果,1,蝴蝶翅膀,1,0,0,0,0",@"咒术师鞋",\
@"丝草,2,坚硬的胡桃,2,草原木头,2,0,0,0,0",@"守护鞋",\
@"丝草,2,黄色之眼,2,魔兽原皮,2,0,0,0,0",@"西部长靴",\
@"丝草,2,野兽原皮,2,草原木头,2,0,0,0,0",@"树叶长靴",\
@"丝草,3,闪避草,1,麻线,2,雨露之丝,1,0,0",@"拳法脚带",\
@"丝草,3,大鳞片,1,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者长靴",\
@"丝草,3,净化之水,3,埃尔托纳水仙,1,雨露之丝,1,0,0",@"神官鞋",\
@"丝草,3,美丽蘑菇,3,七色茧,1,雨露之丝,1,0,0",@"魔导士鞋",\
@"丝草,3,纯白木头,2,大块原骨,2,雨露之丝,1,0,0",@"森人长靴",\
@"闪光草,4,魔兽原骨,1,绿苔,3,雨露之丝,2,0,0",@"击剑士长靴",\
@"闪光草,4,红珊瑚,4,水之树木,2,雨露之丝,2,0,0",@"水之脚带",\
@"闪光草,4,小块化石,2,沙漠水果,1,雨露之丝,2,0,0",@"奇术师长靴",\
@"闪光草,4,光之石,1,万年雪,3,雨露之丝,2,0,0",@"祭司长靴",\
@"闪光草,4,红珊瑚,2,柔软的羊毛,1,雨露之丝,2,0,0",@"神圣长靴",\
@"闪光草,8,万年雪,60,蓝色宝珠,1,雨露之丝,8,0,0",@"真理鞋",\
@"闪光草,8,龙的原皮,2,紫色宝珠,1,雨露之丝,8,0,0",@"大师鞋",\
@"闪光草,8,椰子,60,黄色宝珠,1,雨露之丝,8,0,0",@"混混长靴",\
@"闪光草,10,星之碎片,12,紫色宝珠,1,雨露之丝,8,0,0",@"占星术士长靴",\
@"闪光草,10,光之石,12,绿色宝珠,1,雨露之丝,8,0,0",@"圣者长靴",\
@"闪光草,10,蝙蝠翅膀,12,红色宝珠,1,雨露之丝,8,0,0",@"财宝长靴",\
@"闪光草,10,七色茧,12,蓝色宝珠,1,雨露之丝,8,0,0",@"知识凉鞋",\
@"彩虹色的布片,12,星之碎片,25,汗与泪的结晶,5,紫色宝珠,2,雨露之丝,10",@"月之鞋",\
@"闪避草,12,蝴蝶翅膀,25,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"拳圣鞋",\
@"浓密毛皮,12,小块原骨,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"原始兽长靴",\
@"妖异草,12,猫砂,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"摩登兔鞋",\
@"脏绷带,12,大块原骨,30,汗与泪的结晶,5,红色宝珠,2,雨露之丝,10",@"古武道长靴",\
@"妖异草,12,大块原骨,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"王宫魔术师鞋",\
@"彩虹色的布片,12,红珊瑚,12,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"小丑鞋",\
@"彩虹色的布片,12,大块原骨,30,汗与泪的结晶,5,蓝色宝珠,2,雨露之丝,10",@"奇迹靴子",\
@"浓密毛皮,12,大块原骨,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"古代魔术长靴",\
@"海风草,18,龙的原皮,2,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"求道者长靴",\
@"蝙蝠翅膀,18,小贝壳,60,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大魔导鞋",\
@"野兽原皮,18,龙的原皮,2,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"追击者长靴",\
@"领悟草,18,魔兽原皮,8,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大贤者鞋",\
@"浓密毛皮,18,大块原骨,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"偶像长靴",\
@"彩虹色的布片,18,猫砂,50,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"作曲家脚带",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"羊之鞋",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"领悟长靴",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台鞋",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台长靴",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"台风长靴",\
@"妖精的棉花,24,魔兽原骨,24,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"退魔鞋",\
@"妖精的棉花,24,蛇蜕,60,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"暗鸦靴",\
@"妖精的棉花,24,万年雪,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"圣贤者鞋",\
@"妖精的棉花,24,领悟草,40,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"黄龙鞋",\
@"妖精的棉花,24,坚硬的胡桃,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"古代王族靴",\
@"闪避草,10,美丽蘑菇,10,雨露之丝,1,0,0,0,0",@"豪华的地毯小·绿",\
@"闪避草,15,美丽蘑菇,15,雨露之丝,1,0,0,0,0",@"豪华的地毯中·绿",\
@"闪避草,20,美丽蘑菇,20,雨露之丝,1,0,0,0,0",@"豪华的地毯大·绿",\
@"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·男",\
@"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·女",\
@"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·男",\
@"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·女",\
@"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·男",\
@"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·女",\
@"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·男",\
@"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·女",\
@"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·男",\
@"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·女",\
@"柔软的羊毛,4,夜之幕,4,雨露之丝,3,汗与泪的结晶,10,0,0",@"国际象棋棋盘地毯·黑",\
@"蝙蝠翅膀,30,夜之幕,2,雨露之丝,4,汗与泪的结晶,20,0,0",@"多拉奇地毯",\
@"浓密毛皮,30,脏绷带,10,雨露之丝,4,汗与泪的结晶,20,0,0",@"魔萌地毯",\
@"浓密毛皮,30,樱花花瓣,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"粉红魔萌地毯",\
@"史莱姆果冻,30,史莱姆时尚花,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"史莱姆地毯",\
@"浓密毛皮,30,彩虹色的布片,30,雨露之丝,6,汗与泪的结晶,25,0,0",@"拼布图案地毯·粉",\
@"脏绷带,16,夜之幕,1,雨露之丝,3,汗与泪的结晶,10,0,0",@"黑曜地毯",\
@"闪光草,16,花蜜,16,雨露之丝,5,0,0,0,0",@"水晶地毯",\
@"闪光草,20,彩虹色的布片,20,雨露之丝,5,汗与泪的结晶,20,0,0",@"彩砖花纹地毯",\
@"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"樱桃地毯",\
@"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"豌豆地毯",\
@"夜之幕,2,星之碎片,10,雨露之丝,5,0,0,0,0",@"星空地毯·紫",\
@"闪光草,20,黑珍珠,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"格纹地毯·红",\
@"彩虹色的布片,15,天籁之蜜,10,雨露之丝,5,0,0,0,0",@"音符地毯·黑",\
@"柔软的羊毛,2,净化之水,10,雨露之丝,5,0,0,0,0",@"云朵地毯"
/*@"银矿石,3,浓密毛皮,3,妖精粉,5,0,0,0,0",@"银鱼钩",\
 @"白金矿石,5,蝙蝠翅膀,5,汗与泪的结晶,1,妖精的火种,1,0,0",@"白金鱼钩",\
 @"赤光结晶,7,彩虹色的布片,7,汗与泪的结晶,2,妖精的火种,2,0,0",@"赤光结晶鱼钩",\
 @"金属碎片,1,史莱姆果冻,24,鲨鱼皮,4,汗与泪的结晶,4,妖精的火种,4",@"天使鱼钩",\
 @"金属碎片,1,刺海胆,24,鲨鱼皮,4,汗与泪的结晶,4,妖精的火种,4",@"带刺鱼钩",\
 @"铁矿石,10,埃尔托纳水仙,2,0,0,0,0,0,0",@"豪华的花瓶·绿",\
 @"铁矿石,10,星之碎片,5,0,0,0,0,0,0",@"豪华的瓶·绿",\
 @"铁矿石,10,光之石,5,0,0,0,0,0,0",@"豪华的奥伽半身像·绿",\
 @"铁矿石,10,铜矿石,5,0,0,0,0,0,0",@"豪华的装饰铠甲·绿",\
 @"铁矿石,10,星之碎片,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具岩石",\
 @"铁矿石,10,光之石,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具隧道",\
 @"铁矿石,10,涟漪之露,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具池子",\
 @"铁矿石,10,草原木头,10,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具树",\
 @"铁矿石,10,闪避草,10,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具草原",\
 @"银矿石,16,野兽原皮,16,妖精的火种,4,汗与泪的结晶,30,0,0",@"玩具帐篷",\
 @"银矿石,16,浓密毛皮,16,妖精的火种,4,汗与泪的结晶,30,0,0",@"玩具马戏团",\
 @"白金矿石,20,雷鸣珠,2,妖精的火种,5,汗与泪的结晶,40,0,0",@"移动方舟号",\
 @"冰的结晶,10,光之石,10,妖精的火种,3,汗与泪的结晶,30,0,0",@"莲花落地灯·绿",\
 @"冰的结晶,16,七色茧,8,妖精的火种,3,汗与泪的结晶,30,0,0",@"多彩气球·红黄",\
 @"小贝壳,60,白色珍珠,3,妖精的火种,3,汗与泪的结晶,30,0,0",@"白色珍珠盒",\
 @"花蜜,16,魔兽原角,2,妖精的火种,3,汗与泪的结晶,20,0,0",@"摇摇牛·白",\
 @"美丽蘑菇,20,柔软的羊毛,1,妖精的火种,3,汗与泪的结晶,20,0,0",@"摇摇羊·粉",\
 @"光之石,20,神奇泥浆,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具石山",\
 @"光之石,20,妖异草,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具花草",\
 @"光之石,20,研磨砂,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具圆形房子",\
 @"光之石,20,大贝壳,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具方形房子",\
 @"光之石,20,热乎乎的石头,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具天空·晴",\
 @"星之碎片,30,研磨砂,30,妖精的火种,4,汗与泪的结晶,10,0,0",@"月球仪",\
 @"热乎乎的石头,30,脏绷带,30,妖精的火种,5,汗与泪的结晶,30,0,0",@"史莱姆图案被炉",\
 @"星之碎片,30,冰的结晶,30,妖精的火种,5,汗与泪的结晶,30,0,0",@"闪闪风铃·银",\
 @"光之石,10,小鳞片,10,妖精的火种,2,汗与泪的结晶,6,0,0",@"红色金鱼和鱼缸",\
 @"熔岩碎片,4,祈晴竹叶,12,0,0,0,0,0,0",@"蚊香猪摆设·白",\
 @"熔岩碎片,25,多瓦切卡油,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"加塔拉站模型",\
 @"熔岩碎片,25,奥古力德化石角,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"古莲站模型",\
 @"熔岩碎片,25,普库兰藏红花,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"欧鲁非亚站模型",\
 @"熔岩碎片,25,维纳尔贝壳,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"玖莱特站模型",\
 @"熔岩碎片,25,埃尔托纳水仙,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"安须岚站模型",\
 @"冰的结晶,12,史莱姆果冻,12,妖精的火种,5,0,0,0,0",@"水晶座钟",\
 @"冰的结晶,12,史莱姆果冻,12,妖精的火种,5,0,0,0,0",@"水晶装饰品",\
 @"小贝壳,80,史莱姆果冻,40,妖精的火种,16,汗与泪的结晶,4,0,0",@"史莱姆风铃",\
 @"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"蓝色落地灯饰",\
 @"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"红色落地灯饰",\
 @"光之石,12,妖异草,10,妖精的火种,2,汗与泪的结晶,10,0,0",@"性感舞台灯",\
 @"光之石,12,黄色之眼,5,妖精的火种,2,汗与泪的结晶,20,0,0",@"彩砖落地灯",\
 @"粉红珍珠,5,魔力之土,10,0,0,0,0,0,0",@"小猪存钱罐",\
 @"热乎乎的石头,20,斩风羽,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"格纹落地灯·红",\
 @"星之碎片,4,繁星的眼泪,12,0,0,0,0,0,0",@"星尘灯笼·黄",\
 @"银矿石,20,净化之水,10,妖精的火种,4,0,0,0,0",@"云朵立灯",\
 @"银矿石,20,研磨砂,20,妖精的火种,4,汗与泪的结晶,20,0,0",@"浮花喷泉·银",\
 @"精灵石,1,祈晴竹叶,12,0,0,0,0,0,0",@"西瓜盆·银",\
 @"光之石,10,樱花花瓣,15,妖精的火种,4,0,0,0,0",@"花灯·粉",\
 @"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"蓝色庭用灯饰",\
 @"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"红色庭用灯饰",\
 @"热乎乎的石头,4,繁星的眼泪,12,0,0,0,0,0,0",@"史莱姆灯笼",\*/
/*@"妖精的棉花,24,坚硬的胡桃,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"古代王族靴",\
 @"闪避草,10,美丽蘑菇,10,雨露之丝,1,0,0,0,0",@"豪华的地毯小·绿",\
 @"闪避草,15,美丽蘑菇,15,雨露之丝,1,0,0,0,0",@"豪华的地毯中·绿",\
 @"闪避草,20,美丽蘑菇,20,雨露之丝,1,0,0,0,0",@"豪华的地毯大·绿",\
 @"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·男",\
 @"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·女",\
 @"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·男",\
 @"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·女",\
 @"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·男",\
 @"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·女",\
 @"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·男",\
 @"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·女",\
 @"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·男",\
 @"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·女",\
 @"柔软的羊毛,4,夜之幕,4,雨露之丝,3,汗与泪的结晶,10,0,0",@"国际象棋棋盘地毯·黑",\
 @"蝙蝠翅膀,30,夜之幕,2,雨露之丝,4,汗与泪的结晶,20,0,0",@"多拉奇地毯",\
 @"浓密毛皮,30,脏绷带,10,雨露之丝,4,汗与泪的结晶,20,0,0",@"魔萌地毯",\
 @"浓密毛皮,30,樱花花瓣,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"粉红魔萌地毯",\
 @"史莱姆果冻,30,史莱姆时尚花,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"史莱姆地毯",\
 @"浓密毛皮,30,彩虹色的布片,30,雨露之丝,6,汗与泪的结晶,25,0,0",@"拼布图案地毯·粉",\
 @"脏绷带,16,夜之幕,1,雨露之丝,3,汗与泪的结晶,10,0,0",@"黑曜地毯",\
 @"闪光草,16,花蜜,16,雨露之丝,5,0,0,0,0",@"水晶地毯",\
 @"闪光草,20,彩虹色的布片,20,雨露之丝,5,汗与泪的结晶,20,0,0",@"彩砖花纹地毯",\
 @"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"樱桃地毯",\
 @"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"豌豆地毯",\
 @"夜之幕,2,星之碎片,10,雨露之丝,5,0,0,0,0",@"星空地毯·紫",\
 @"闪光草,20,黑珍珠,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"格纹地毯·红",\
 @"彩虹色的布片,15,天籁之蜜,10,雨露之丝,5,0,0,0,0",@"音符地毯·黑",\
 @"柔软的羊毛,2,净化之水,10,雨露之丝,5,0,0,0,0",@"云朵地毯",\*/
/*
@"草原木头,10,浓密毛皮,8,闪光树汁,1,0,0,0,0",@"豪华的椅子·绿",\
@"草原木头,14,浓密毛皮,16,闪光树汁,2,0,0,0,0",@"豪华的长椅·绿",\
@"草原木头,20,黄金碎片,2,闪光树汁,3,0,0,0,0",@"豪华的宝座·绿",\
@"草原木头,10,小贝壳,10,闪光树汁,1,0,0,0,0",@"豪华的桌子小·绿",\
@"草原木头,14,大贝壳,10,闪光树汁,2,0,0,0,0",@"豪华的桌子大·绿",\
@"草原木头,12,万年雪,12,闪光树汁,1,0,0,0,0",@"豪华的陈列柜·绿",\
@"草原木头,16,美丽蘑菇,12,闪光树汁,2,0,0,0,0",@"豪华的衣柜·绿",\
@"草原木头,10,大贝壳,10,闪光树汁,1,0,0,0,0",@"豪华的书架·绿",\
@"草原木头,10,小贝壳,20,闪光树汁,1,0,0,0,0",@"豪华的餐具架·绿",\
@"草原木头,12,红珊瑚,8,闪光树汁,1,0,0,0,0",@"豪华的厨台·绿",\
@"草原木头,12,熔岩碎片,8,闪光树汁,1,0,0,0,0",@"豪华的烤炉·绿",\
@"草原木头,20,浓密毛皮,20,闪光树汁,3,0,0,0,0",@"豪华的床·绿",\
@"草原木头,14,涟漪之露,10,闪光树汁,2,0,0,0,0",@"豪华的浴盆·绿",\
@"草原木头,10,绿苔,10,闪光树汁,1,0,0,0,0",@"豪华的屏风·绿",\
@"草原木头,16,星之碎片,10,闪光树汁,2,0,0,0,0",@"豪华的收纳柜·绿",\
@"草原木头,12,绿苔,10,闪光树汁,1,0,0,0,0",@"豪华的柜台小·绿",\
@"草原木头,16,绿苔,20,闪光树汁,2,0,0,0,0",@"豪华的柜台大·绿",\
@"草原木头,14,熔岩碎片,12,闪光树汁,2,0,0,0,0",@"豪华的暖炉·绿",\
@"草原木头,20,沙漠水果,16,闪光树汁,3,0,0,0,0",@"豪华的宴会桌·绿",\
@"纯白木头,10,坚硬的胡桃,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格椅子",\
@"纯白木头,14,坚硬的胡桃,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格长椅",\
@"纯白木头,10,红浆果,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格桌子小",\
@"纯白木头,14,红浆果,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格桌子大",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格衣柜",\
@"纯白木头,10,坚硬的胡桃,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格书架",\
@"纯白木头,10,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格餐具架",\
@"纯白木头,12,天籁之蜜,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格厨台",\
@"纯白木头,12,坚硬的胡桃,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格烤炉",\
@"纯白木头,20,天籁之蜜,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"点心风格床",\
@"纯白木头,14,天籁之蜜,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格浴盆",\
@"纯白木头,10,花蜜,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格屏风",\
@"纯白木头,16,花蜜,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格收纳柜",\
@"纯白木头,12,花蜜,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格柜台小",\
@"纯白木头,16,花蜜,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格柜台大",\
@"纯白木头,20,沙漠水果,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"点心风格宴会桌",\
@"冰之树木,10,史莱姆果冻,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆椅子",\
@"冰之树木,14,史莱姆果冻,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆长椅",\
@"冰之树木,10,史莱姆时尚花,4,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆桌子小",\
@"冰之树木,14,史莱姆时尚花,8,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆桌子大",\
@"冰之树木,16,史莱姆时尚花,12,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆衣柜",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆书架",\
@"冰之树木,10,沙漠水果,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆餐具架",\
@"冰之树木,12,史莱姆果冻,12,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆厨台",\
@"冰之树木,12,史莱姆时尚花,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆烤炉",\
@"冰之树木,20,史莱姆时尚花,20,闪光树汁,5,汗与泪的结晶,20,0,0",@"史莱姆床",\
@"冰之树木,14,史莱姆果冻,8,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆浴盆",\
@"冰之树木,10,史莱姆果冻,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆屏风",\
@"冰之树木,16,史莱姆果冻,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆收纳柜",\
@"冰之树木,12,史莱姆果冻,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆柜台小",\
@"冰之树木,16,史莱姆果冻,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆柜台大",\
@"冰之树木,20,沙漠水果,16,闪光树汁,5,汗与泪的结晶,20,0,0",@"史莱姆宴会桌",\
@"暗黑树木,10,蝙蝠翅膀,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特椅子",\
@"暗黑树木,14,蝙蝠翅膀,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特长椅",\
@"暗黑树木,10,蛇蜕,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特桌子小",\
@"暗黑树木,14,蛇蜕,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特桌子大",\
@"暗黑树木,16,妖异草,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特衣柜",\
@"暗黑树木,10,蛇蜕,20,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特书架",\
@"暗黑树木,10,蝙蝠翅膀,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特餐具架",\
@"暗黑树木,12,妖异草,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特厨台",\
@"暗黑树木,12,熔岩碎片,20,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特烤炉",\
@"暗黑树木,20,蝙蝠翅膀,20,闪光树汁,5,汗与泪的结晶,20,0,0",@"哥特床",\
@"暗黑树木,14,涟漪之露,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特浴盆",\
@"暗黑树木,10,蝙蝠翅膀,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特屏风",\
@"暗黑树木,16,蛇蜕,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特收纳柜",\
@"暗黑树木,12,蛇蜕,12,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特柜台小",\
@"暗黑树木,16,蛇蜕,24,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特柜台大",\
@"暗黑树木,20,沙漠水果,16,闪光树汁,5,汗与泪的结晶,20,0,0",@"哥特宴会桌",\
@"草原木头,5,红珊瑚,5,铁制钉子,4,0,0,0,0",@"单层方块·红",\
@"草原木头,10,红珊瑚,10,铁制钉子,8,0,0,0,0",@"双层方块·红",\
@"草原木头,15,红珊瑚,15,铁制钉子,12,0,0,0,0",@"三层方块·红",\
@"草原木头,5,维纳尔贝壳,5,铁制钉子,4,0,0,0,0",@"单层方块·蓝",\
@"草原木头,10,维纳尔贝壳,10,铁制钉子,8,0,0,0,0",@"双层方块·蓝",\
@"草原木头,15,维纳尔贝壳,15,铁制钉子,12,0,0,0,0",@"三层方块·蓝",\
@"草原木头,5,绿苔,5,铁制钉子,4,0,0,0,0",@"单层方块·绿",\
@"草原木头,10,绿苔,10,铁制钉子,8,0,0,0,0",@"双层方块·绿",\
@"草原木头,15,绿苔,15,铁制钉子,12,0,0,0,0",@"三层方块·绿",\
@"红珊瑚,10,小贝壳,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形椅子·粉",\
@"红珊瑚,10,樱花花瓣,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形桌子小·粉",\
@"红珊瑚,12,研磨砂,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形柜台小·粉",\
@"红珊瑚,14,大贝壳,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形长椅·粉",\
@"红珊瑚,14,樱花花瓣,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形桌子大·粉",\
@"红珊瑚,16,研磨砂,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形柜台大·粉",\
@"红珊瑚,20,椰子,10,闪光树汁,5,汗与泪的结晶,10,0,0",@"心形宴会桌·粉",\
@"红珊瑚,10,妖异草,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形屏风·粉",\
@"红珊瑚,10,美丽蘑菇,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形书架·粉",\
@"红珊瑚,10,彩虹色的布片,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形餐具架·粉",\
@"红珊瑚,12,美丽蘑菇,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形厨台·粉",\
@"红珊瑚,12,蛤蟆油,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形烤炉·粉",\
@"红珊瑚,14,涟漪之露,10,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形浴盆·粉",\
@"红珊瑚,16,彩虹色的布片,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形衣柜·粉",\
@"红珊瑚,16,美丽蘑菇,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形收纳柜·粉",\
@"红珊瑚,20,妖异草,20,闪光树汁,5,汗与泪的结晶,10,0,0",@"心形床·粉",\
@"草原木头,10,金块,1,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫椅子·蓝",\
@"草原木头,10,蛇蜕,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫桌子小·蓝",\
@"草原木头,12,研磨砂,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫柜台小·蓝",\
@"草原木头,14,金块,1,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫长椅·蓝",\
@"草原木头,14,蛇蜕,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫桌子大·蓝",\
@"草原木头,16,研磨砂,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫柜台大·蓝",\
@"草原木头,20,椰子,10,闪光树汁,5,汗与泪的结晶,10,0,0",@"王宫宴会桌·蓝",\
@"草原木头,10,大块原骨,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫屏风·蓝",\
@"草原木头,10,蛇蜕,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫书架·蓝",\
@"草原木头,10,小贝壳,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫餐具架·蓝",\
@"草原木头,12,大贝壳,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫厨台·蓝",\
@"草原木头,12,热乎乎的石头,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫烤炉·蓝",\
@"草原木头,14,净化之水,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫浴盆·蓝",\
@"草原木头,16,蛇蜕,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫衣柜·蓝",\
@"草原木头,16,大鳞片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫收纳柜·蓝",\
@"草原木头,20,浓密毛皮,20,闪光树汁,5,汗与泪的结晶,10,0,0",@"王宫床·蓝",\
@"暗黑树木,16,彩虹色的布片,16,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案沙发·粉",\
@"暗黑树木,20,彩虹色的布片,20,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案桌子·粉",\
@"暗黑树木,24,彩虹色的布片,24,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案床·粉",\
@"冰之树木,10,热乎乎的石头,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜椅子",\
@"冰之树木,10,热乎乎的石头,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜桌子小",\
@"冰之树木,12,热乎乎的石头,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜柜台小",\
@"冰之树木,14,热乎乎的石头,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜长椅",\
@"冰之树木,14,热乎乎的石头,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜桌子大",\
@"冰之树木,16,热乎乎的石头,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜柜台大",\
@"冰之树木,20,热乎乎的石头,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜宴会桌",\
@"冰之树木,20,热乎乎的石头,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜宝座",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜屏风",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜书架",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜餐具架",\
@"冰之树木,12,熔岩碎片,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜厨台",\
@"冰之树木,12,熔岩碎片,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜烤炉",\
@"冰之树木,14,熔岩碎片,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜浴盆",\
@"冰之树木,16,熔岩碎片,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜衣柜",\
@"冰之树木,16,熔岩碎片,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜收纳柜",\
@"冰之树木,20,熔岩碎片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜床",\
@"冰之树木,20,熔岩碎片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜暖炉",\
@"纯白木头,10,樱花花瓣,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主椅子·粉",\
@"纯白木头,10,美丽蘑菇,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主桌子小·粉",\
@"纯白木头,12,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主柜台小·粉",\
@"纯白木头,14,樱花花瓣,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主长椅·粉",\
@"纯白木头,14,美丽蘑菇,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主桌子大·粉",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主柜台大·粉",\
@"纯白木头,20,史莱姆时尚花,3,闪光树汁,4,汗与泪的结晶,10,0,0",@"公主宴会桌·粉",\
@"纯白木头,10,彩虹色的布片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主屏风·粉",\
@"纯白木头,10,大贝壳,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主书架·粉",\
@"纯白木头,10,粉红珍珠,3,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主餐具架·粉",\
@"纯白木头,12,大贝壳,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主厨台·粉",\
@"纯白木头,12,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主烤炉·粉",\
@"纯白木头,14,粉红珍珠,4,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主浴盆·粉",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主衣柜·粉",\
@"纯白木头,16,樱花花瓣,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主收纳柜·粉",\
@"纯白木头,20,史莱姆时尚花,3,闪光树汁,4,汗与泪的结晶,10,0,0",@"公主床·粉",\
@"结实的树枝,10,热乎乎的石头,10,闪光树汁,4,0,0,0,0",@"蒸汽时代椅子",\
@"结实的树枝,10,热乎乎的石头,10,闪光树汁,4,0,0,0,0",@"蒸汽时代桌子小",\
@"结实的树枝,12,热乎乎的石头,12,闪光树汁,4,0,0,0,0",@"蒸汽时代柜台小",\
@"结实的树枝,14,热乎乎的石头,14,闪光树汁,5,0,0,0,0",@"蒸汽时代长椅",\
@"结实的树枝,14,热乎乎的石头,14,闪光树汁,5,0,0,0,0",@"蒸汽时代桌子大",\
@"结实的树枝,16,热乎乎的石头,16,闪光树汁,5,0,0,0,0",@"蒸汽时代柜台大",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代屏风",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代书架",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代餐具架",\
@"结实的树枝,12,熔岩碎片,12,闪光树汁,4,0,0,0,0",@"蒸汽时代厨台",\
@"结实的树枝,12,熔岩碎片,12,闪光树汁,4,0,0,0,0",@"蒸汽时代烤炉",\
@"结实的树枝,14,熔岩碎片,14,闪光树汁,5,0,0,0,0",@"蒸汽时代浴盆",\
@"结实的树枝,16,熔岩碎片,16,闪光树汁,5,0,0,0,0",@"蒸汽时代衣柜",\
@"结实的树枝,16,熔岩碎片,16,闪光树汁,5,0,0,0,0",@"蒸汽时代收纳柜",\
@"结实的树枝,20,熔岩碎片,20,闪光树汁,6,0,0,0,0",@"蒸汽时代床",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,4,0,0,0,0",@"水晶椅子",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,4,0,0,0,0",@"水晶桌子小",\
@"冰之树木,12,史莱姆果冻,12,闪光树汁,4,0,0,0,0",@"水晶柜台小",\
@"冰之树木,14,史莱姆果冻,14,闪光树汁,5,0,0,0,0",@"水晶长椅",\
@"冰之树木,14,史莱姆果冻,14,闪光树汁,5,0,0,0,0",@"水晶桌子大",\
@"冰之树木,16,史莱姆果冻,16,闪光树汁,5,0,0,0,0",@"水晶柜台大",\
@"冰之树木,20,史莱姆果冻,20,闪光树汁,6,0,0,0,0",@"水晶宝座",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶屏风",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶书架",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶餐具架",\
@"冰之树木,12,小贝壳,12,闪光树汁,4,0,0,0,0",@"水晶厨台",\
@"冰之树木,12,小贝壳,12,闪光树汁,4,0,0,0,0",@"水晶烤炉",\
@"冰之树木,14,小贝壳,14,闪光树汁,5,0,0,0,0",@"水晶浴盆",\
@"冰之树木,16,小贝壳,16,闪光树汁,5,0,0,0,0",@"水晶衣柜",\
@"冰之树木,16,小贝壳,16,闪光树汁,5,0,0,0,0",@"水晶收纳柜",\
@"冰之树木,20,小贝壳,20,闪光树汁,6,0,0,0,0",@"水晶床",\
@"冰之树木,20,小贝壳,20,闪光树汁,6,0,0,0,0",@"水晶暖炉",\
@"草原木头,20,光之石,10,闪光树汁,8,0,0,0,0",@"星耀椅子·红",\
@"草原木头,20,光之石,10,闪光树汁,8,0,0,0,0",@"星耀脚踏·红",\
@"结实的树枝,10,美丽蘑菇,10,闪光树汁,2,0,0,0,0",@"红蘑菇椅子",\
@"结实的树枝,14,美丽蘑菇,12,闪光树汁,3,0,0,0,0",@"红蘑菇桌子",\
@"结实的树枝,14,美丽蘑菇,12,闪光树汁,4,0,0,0,0",@"红蘑菇床",\
@"结实的树枝,10,美丽蘑菇,10,闪光树汁,2,0,0,0,0",@"红蘑菇装饰品",\
@"炎之树木,10,红色之眼,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"导演椅子·红",\
@"炎之树木,14,粉红珍珠,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感桌子",\
@"炎之树木,14,粉红珍珠,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感衣柜",\
@"炎之树木,20,粉红珍珠,16,闪光树汁,5,汗与泪的结晶,10,0,0",@"性感床",\
@"炎之树木,20,粉红珍珠,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"性感浴盆",\
@"炎之树木,18,妖异草,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"性感沙发",\
@"炎之树木,14,妖异草,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感梳妆台",\
@"暗黑树木,12,红色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖椅子",\
@"暗黑树木,18,红色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖桌子",\
@"暗黑树木,16,绿色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖衣柜",\
@"暗黑树木,14,绿色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖书架",\
@"暗黑树木,20,蓝色之眼,5,闪光树汁,4,汗与泪的结晶,20,0,0",@"彩砖床",\
@"暗黑树木,18,蓝色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖沙发",\
@"暗黑树木,14,紫色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖梳妆台",\
@"暗黑树木,16,紫色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖收纳柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"西瓜椅子",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"西瓜桌子",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"苹果衣柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"橙子书架",\
@"草原木头,20,冷达种子,6,闪光树汁,6,0,0,0,0",@"西洋梨床",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"香蕉沙发",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"菠萝梳妆台",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"蜜瓜收纳柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"萝卜椅子",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"番薯桌子",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"胡萝卜衣柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"茄子书架",\
@"草原木头,20,冷达种子,6,闪光树汁,6,0,0,0,0",@"玉米床",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"番茄沙发",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"青椒梳妆台",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"洋葱收纳柜",\
@"草原木头,4,繁星的眼泪,12,0,0,0,0,0,0",@"带蚊帐的被褥·黄",\
@"暗黑树木,6,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空椅子·紫",\
@"暗黑树木,8,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空小桌·紫",\
@"暗黑树木,10,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空衣柜·紫",\
@"暗黑树木,8,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空书架·紫",\
@"暗黑树木,12,星之碎片,12,闪光树汁,6,0,0,0,0",@"星空床·紫",\
@"暗黑树木,10,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空沙发·紫",\
@"暗黑树木,6,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空梳妆台·紫",\
@"暗黑树木,8,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空收纳柜·紫",\
@"草原木头,12,白色珍珠,8,闪光树汁,4,汗与泪的结晶,10,0,0",@"格纹椅子·红",\
@"草原木头,16,白色珍珠,8,闪光树汁,4,汗与泪的结晶,10,0,0",@"格纹桌子·红",\
@"草原木头,20,白色珍珠,12,闪光树汁,6,汗与泪的结晶,15,0,0",@"格纹床·红",\
@"暗黑树木,6,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符椅子·黑",\
@"暗黑树木,10,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符长椅·黑",\
@"暗黑树木,8,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符桌子·黑",\
@"暗黑树木,10,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符衣柜·黑",\
@"暗黑树木,8,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符书架·黑",\
@"暗黑树木,12,天籁之蜜,12,闪光树汁,6,0,0,0,0",@"音符床·黑",\
@"暗黑树木,8,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符收纳柜·黑",\
@"纯白木头,3,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵椅子",\
@"纯白木头,4,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵桌子",\
@"纯白木头,5,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵衣柜",\
@"纯白木头,4,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵书架",\
@"纯白木头,6,净化之水,12,闪光树汁,6,0,0,0,0",@"云朵床",\
@"纯白木头,5,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵沙发",\
@"纯白木头,3,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵梳妆台",\
@"纯白木头,4,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵收纳柜",\
@"史莱姆时尚花,6,花蜜,10,闪光树汁,6,汗与泪的结晶,20,0,0",@"花货车·鲜艳",\
@"柔韧的树枝,4,祈晴竹叶,12,0,0,0,0,0,0",@"鲜艳的七夕竹饰",\
@"干净的树枝,4,祈晴竹叶,12,0,0,0,0,0,0",@"七夕飘带·花",\
@"结实的树枝,4,繁星的眼泪,12,0,0,0,0,0,0",@"丝瓜架",\
@"结实的树枝,4,蛇蜕,4,妖精粉,5,0,0,0,0",@"结实的钓竿",\
@"干净的树枝,6,蝴蝶翅膀,6,汗与泪的结晶,1,闪光树汁,1,0,0",@"漂亮的钓竿",\
@"炎之树木,8,熔岩碎片,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"炎之钓竿",\
@"冰之树木,8,冰的结晶,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"冰之钓竿",\
@"暗黑树木,8,脏绷带,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"暗之钓竿",\
@"炎之树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"炎之钓竿改",\
@"冰之树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"冰之钓竿改",\
@"暗黑树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"暗之钓竿改",\
@"柔软的肉,3,巨型洋葱,2,美味食用油,3,0,0,0,0",@"灵巧肉包",\
@"柔软的肉,4,浑圆土豆,3,浓醇酱汁,5,美味食用油,5,0,0",@"力量肉排",\
@"柔软的肉,4,松软小麦,3,浓醇酱汁,5,美味食用油,6,0,0",@"会心汉堡",\
@"柔软的肉,4,新鲜的蛋,3,闪避草,10,美味食用油,6,0,0",@"闪避蛋包饭",\
@"霜降肉,2,清脆莴苣,6,吓人番茄,3,微辣胡椒,3,美味食用油,12",@"杂技汉堡",\
@"霜降肉,1,清脆莴苣,3,吓人番茄,2,微辣胡椒,2,美味食用油,6",@"杂技汉堡·小",\
@"霜降肉,2,新鲜的蛋,6,吓人番茄,3,浓醇酱汁,3,美味食用油,12",@"爱情蛋包饭",\
@"霜降肉,1,新鲜的蛋,3,吓人番茄,2,浓醇酱汁,2,美味食用油,6",@"爱情蛋包饭·小",\
@"霜降肉,3,巨型洋葱,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"战斗牛排",\
@"霜降肉,2,巨型洋葱,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"战斗牛排·小",\
@"切块鱼肉,3,浑圆土豆,2,美味食用油,3,0,0,0,0",@"治愈浓汤",\
@"切块鱼肉,4,清脆莴苣,3,美味食用油,4,0,0,0,0",@"守护者沙拉",\
@"切块鱼肉,4,清脆莴苣,3,松软小麦,3,美味食用油,5,0,0",@"魔法三明治",\
@"顶级鱼腩,2,松软小麦,6,吓人番茄,3,顶级食盐,3,美味食用油,12",@"治愈煎鱼",\
@"顶级鱼腩,1,松软小麦,3,吓人番茄,2,顶级食盐,2,美味食用油,6",@"治愈煎鱼·小",\
@"顶级鱼腩,3,清脆莴苣,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"魔法汤",\
@"顶级鱼腩,2,清脆莴苣,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"魔法汤·小",\
@"顶级鱼腩,3,巨型洋葱,6,吓人番茄,4,浓醇酱汁,4,美味食用油,16",@"奇迹三明治",\
@"顶级鱼腩,2,巨型洋葱,3,吓人番茄,2,浓醇酱汁,2,美味食用油,8",@"奇迹三明治·小",\
@"顶级鱼腩,3,浑圆土豆,6,吓人番茄,4,顶级食盐,4,美味食用油,16",@"土豆泥",\
@"顶级鱼腩,2,浑圆土豆,3,吓人番茄,2,顶级食盐,2,美味食用油,8",@"土豆泥·小",\
@"顶级鱼腩,3,新鲜的蛋,6,吓人番茄,4,顶级食盐,4,美味食用油,16",@"奢华烤菜",\
@"顶级鱼腩,2,新鲜的蛋,3,吓人番茄,2,顶级食盐,2,美味食用油,8",@"奢华烤菜·小",\
@"柔软的肉,3,稻花,2,美味食用油,2,0,0,0,0",@"体力米饭",\
@"切块鱼肉,3,松软小麦,2,美味食用油,2,0,0,0,0",@"能量意面",\
@"柔软的肉,4,浑圆土豆,3,稻花,3,美味食用油,6,0,0",@"超大碗盖饭",\
@"顶级鱼腩,2,松软小麦,6,吓人番茄,3,浓醇酱汁,3,美味食用油,12",@"平衡意面",\
@"顶级鱼腩,1,松软小麦,3,吓人番茄,2,浓醇酱汁,2,美味食用油,6",@"平衡意面·小",\
@"霜降肉,3,稻花,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"香料咖喱",\
@"霜降肉,2,稻花,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"香料咖喱·小",\
@"顶级鱼腩,3,稻花,6,吓人番茄,4,浓醇酱汁,4,美味食用油,16",@"足量烩饭",\
@"顶级鱼腩,2,稻花,3,吓人番茄,2,浓醇酱汁,2,美味食用油,8",@"足量烩饭·小",\
@"新鲜的蛋,3,美味的奶,1,美味食用油,1,0,0,0,0",@"快速蛋糕",\
@"新鲜的蛋,3,花蜜,1,美味食用油,1,0,0,0,0",@"华丽的曲奇",\
@"新鲜的蛋,10,红浆果,10,顶级食盐,3,美味食用油,8,0,0",@"烈焰蛋挞",\
@"新鲜的蛋,5,红浆果,5,顶级食盐,2,美味食用油,4,0,0",@"烈焰蛋挞·小",\
@"新鲜的蛋,10,冰的结晶,10,顶级食盐,3,美味食用油,8,0,0",@"寒冰蛋挞",\
@"新鲜的蛋,5,冰的结晶,5,顶级食盐,2,美味食用油,4,0,0",@"寒冰蛋挞·小",\
@"美味的奶,10,天使的神酒,1,顶级食盐,3,美味食用油,8,0,0",@"光明蛋挞",\
@"美味的奶,5,净化之水,5,顶级食盐,2,美味食用油,4,0,0",@"光明蛋挞·小",\
@"美味的奶,10,坚硬的胡桃,10,顶级食盐,3,美味食用油,8,0,0",@"黑暗蛋挞",\
@"美味的奶,5,坚硬的胡桃,5,顶级食盐,2,美味食用油,4,0,0",@"黑暗蛋挞·小",\
@"美味的奶,10,闪避草,10,顶级食盐,3,美味食用油,8,0,0",@"风暴蛋挞",\
@"美味的奶,5,闪避草,5,顶级食盐,2,美味食用油,4,0,0",@"风暴蛋挞·小",\
@"顶级鱼腩,2,美味的奶,6,吓人番茄,3,顶级食盐,3,美味食用油,12",@"明星点心",\
@"顶级鱼腩,1,美味的奶,3,吓人番茄,2,顶级食盐,2,美味食用油,6",@"明星点心·小",\
@"稻花,4,繁星的眼泪,4,美味食用油,1,0,0,0,0",@"赔罪竹叶团子"*/

//素材列表
#define MATERIAL_ITEM               @[@"素材列表"]
#define MATERIAL_ITEM_NAMES			@[@[@"七色茧",\
@"万年雪",\
@"丝草",\
@"光之石",\
@"冰之树木",\
@"冰的结晶",\
@"冷达种子",\
@"净化之水",\
@"切块鱼肉",\
@"利爪",\
@"利齿",\
@"刺海胆",\
@"史莱姆时尚花",\
@"史莱姆果冻",\
@"吓人番茄",\
@"圣者之灰",\
@"坚硬的胡桃",\
@"埃尔托纳水仙",\
@"多瓦切卡油",\
@"夜之幕",\
@"夜色万寿菊",\
@"大仙人掌",\
@"大块化石",\
@"大块原骨",\
@"大甲壳",\
@"大贝壳",\
@"大鳞片",\
@"天使的神酒",\
@"天籁之蜜",\
@"奥古力德化石角",\
@"妖异草",\
@"妖精的棉花",\
@"妖精的火种",\
@"妖精粉",\
@"小块化石",\
@"小块原骨",\
@"小甲壳",\
@"小贝壳",\
@"小鳞片",\
@"巧克力色郁金香",\
@"巨型洋葱",\
@"干净的树枝",\
@"幻兽原皮",\
@"幻兽原骨",\
@"幻魔石",\
@"彩虹宝珠",\
@"彩虹色的布片",\
@"微辣胡椒",\
@"拳骨菇",\
@"斩风羽",\
@"新鲜的蛋",\
@"时之水晶",\
@"星之碎片",\
@"普库兰藏红花",\
@"暗黑树木",\
@"木棉草",\
@"松软小麦",\
@"柔软的树枝",\
@"柔软的羊毛",\
@"柔软的肉",\
@"柔韧的树枝",\
@"椰子",\
@"樱花花瓣",\
@"橙色铃兰",\
@"武道精华",\
@"毒毒淤泥",\
@"水之树木",\
@"水蓝色万寿菊",\
@"汗与泪的结晶",\
@"沙漠水果",\
@"浑圆土豆",\
@"浓密毛皮",\
@"浓醇酱汁",\
@"海风草",\
@"涟漪之露",\
@"淡紫色铃兰",\
@"清脆莴苣",\
@"灰蓝色万寿菊",\
@"炎之树木",\
@"热乎乎的石头",\
@"焦糖色郁金香",\
@"熔岩碎片",\
@"牛粪",\
@"猫砂",\
@"白色珍珠",\
@"白金矿石",\
@"研磨砂",\
@"祈晴竹叶",\
@"神奇泥浆",\
@"神奇海草",\
@"稻花",\
@"粉红珍珠",\
@"精灵石",\
@"紫色之眼",\
@"紫色宝珠",\
@"繁星的眼泪",\
@"红浆果",\
@"红珊瑚",\
@"红色之眼",\
@"红色宝珠",\
@"红色宝石",\
@"纯白木头",\
@"结实的树枝",\
@"维纳尔贝壳",\
@"绿色之眼",\
@"绿色宝珠",\
@"绿色宝石",\
@"绿苔",\
@"美丽蘑菇",\
@"美味的奶",\
@"美味食用油",\
@"翡翠绿百合",\
@"脏绷带",\
@"腌菜石",\
@"花蜜",\
@"草原之水",\
@"草原木头",\
@"蓝色之眼",\
@"蓝色宝珠",\
@"蓝色宝石",\
@"蛇蜕",\
@"蛤蟆油",\
@"蝙蝠翅膀",\
@"蝴蝶翅膀",\
@"赤光结晶",\
@"转生之辉石",\
@"重金属",\
@"野兽原皮",\
@"金块",\
@"金属碎片",\
@"铁制钉子",\
@"铁矿石",\
@"铜矿石",\
@"银矿石",\
@"镜之石",\
@"闪光树汁",\
@"闪光草",\
@"闪避草",\
@"雨露之丝",\
@"雷鸣珠",\
@"雾灰色铃兰",\
@"霜降肉",\
@"顶级食盐",\
@"顶级鱼腩",\
@"领悟草",\
@"马粪",\
@"魔兽原皮",\
@"魔兽原角",\
@"魔兽原骨",\
@"魔力之土",\
@"魔法树木",\
@"鲨鱼皮",\
@"麻线",\
@"黄色之眼",\
@"黄色宝珠",\
@"黄色宝石",\
@"黄金石",\
@"黄金碎片",\
@"黄金装饰单手剑",\
@"黄金装饰双手剑",\
@"黄金装饰双手杖",\
@"黄金装饰回旋镖",\
@"黄金装饰头盔",\
@"黄金装饰弓",\
@"黄金装饰扇",\
@"黄金装饰护臂",\
@"黄金装饰斧",\
@"黄金装饰棍",\
@"黄金装饰爪",\
@"黄金装饰盾",\
@"黄金装饰矛",\
@"黄金装饰短剑",\
@"黄金装饰短杖",\
@"黄金装饰铠甲上装",\
@"黄金装饰铠甲下装",\
@"黄金装饰锤",\
@"黄金装饰鞋",\
@"黄金装饰鞭",\
@"黑珍珠",\
@"龙的原皮",\
@"龙的原角",\
@"龙的原骨"]]
#define MATERIAL_ITEM_IMAGES		@[@[@"Icon-七色茧.png",\
@"Icon-万年雪.png",\
@"Icon-丝草.png",\
@"Icon-光之石.png",\
@"Icon-冰之树木.png",\
@"Icon-冰的结晶.png",\
@"Icon-冷达种子.png",\
@"Icon-净化之水.png",\
@"Icon-切块鱼肉.png",\
@"Icon-利爪.png",\
@"Icon-利齿.png",\
@"Icon-刺海胆.png",\
@"Icon-史莱姆时尚花.png",\
@"Icon-史莱姆果冻.png",\
@"Icon-吓人番茄.png",\
@"Icon-圣者之灰.png",\
@"Icon-坚硬的胡桃.png",\
@"Icon-埃尔托纳水仙.png",\
@"Icon-多瓦切卡油.png",\
@"Icon-夜之幕.png",\
@"Icon-夜色万寿菊.png",\
@"Icon-大仙人掌.png",\
@"Icon-大块化石.png",\
@"Icon-大块原骨.png",\
@"Icon-大甲壳.png",\
@"Icon-大贝壳.png",\
@"Icon-大鳞片.png",\
@"Icon-天使的神酒.png",\
@"Icon-天籁之蜜.png",\
@"Icon-奥古力德化石角.png",\
@"Icon-妖异草.png",\
@"Icon-妖精的棉花.png",\
@"Icon-妖精的火种.png",\
@"Icon-妖精粉.png",\
@"Icon-小块化石.png",\
@"Icon-小块原骨.png",\
@"Icon-小甲壳.png",\
@"Icon-小贝壳.png",\
@"Icon-小鳞片.png",\
@"Icon-巧克力色郁金香.png",\
@"Icon-巨型洋葱.png",\
@"Icon-干净的树枝.png",\
@"Icon-幻兽原皮.png",\
@"Icon-幻兽原骨.png",\
@"Icon-幻魔石.png",\
@"Icon-彩虹宝珠.png",\
@"Icon-彩虹色的布片.png",\
@"Icon-微辣胡椒.png",\
@"Icon-拳骨菇.png",\
@"Icon-斩风羽.png",\
@"Icon-新鲜的蛋.png",\
@"Icon-时之水晶.png",\
@"Icon-星之碎片.png",\
@"Icon-普库兰藏红花.png",\
@"Icon-暗黑树木.png",\
@"Icon-木棉草.png",\
@"Icon-松软小麦.png",\
@"Icon-柔软的树枝.png",\
@"Icon-柔软的羊毛.png",\
@"Icon-柔软的肉.png",\
@"Icon-柔韧的树枝.png",\
@"Icon-椰子.png",\
@"Icon-樱花花瓣.png",\
@"Icon-橙色铃兰.png",\
@"Icon-武道精华.png",\
@"Icon-毒毒淤泥.png",\
@"Icon-水之树木.png",\
@"Icon-水蓝色万寿菊.png",\
@"Icon-汗与泪的结晶.png",\
@"Icon-沙漠水果.png",\
@"Icon-浑圆土豆.png",\
@"Icon-浓密毛皮.png",\
@"Icon-浓醇酱汁.png",\
@"Icon-海风草.png",\
@"Icon-涟漪之露.png",\
@"Icon-淡紫色铃兰.png",\
@"Icon-清脆莴苣.png",\
@"Icon-灰蓝色万寿菊.png",\
@"Icon-炎之树木.png",\
@"Icon-热乎乎的石头.png",\
@"Icon-焦糖色郁金香.png",\
@"Icon-熔岩碎片.png",\
@"Icon-牛粪.png",\
@"Icon-猫砂.png",\
@"Icon-白色珍珠.png",\
@"Icon-白金矿石.png",\
@"Icon-研磨砂.png",\
@"Icon-祈晴竹叶.png",\
@"Icon-神奇泥浆.png",\
@"Icon-神奇海草.png",\
@"Icon-稻花.png",\
@"Icon-粉红珍珠.png",\
@"Icon-精灵石.png",\
@"Icon-紫色之眼.png",\
@"Icon-紫色宝珠.png",\
@"Icon-繁星的眼泪.png",\
@"Icon-红浆果.png",\
@"Icon-红珊瑚.png",\
@"Icon-红色之眼.png",\
@"Icon-红色宝珠.png",\
@"Icon-红色宝石.png",\
@"Icon-纯白木头.png",\
@"Icon-结实的树枝.png",\
@"Icon-维纳尔贝壳.png",\
@"Icon-绿色之眼.png",\
@"Icon-绿色宝珠.png",\
@"Icon-绿色宝石.png",\
@"Icon-绿苔.png",\
@"Icon-美丽蘑菇.png",\
@"Icon-美味的奶.png",\
@"Icon-美味食用油.png",\
@"Icon-翡翠绿百合.png",\
@"Icon-脏绷带.png",\
@"Icon-腌菜石.png",\
@"Icon-花蜜.png",\
@"Icon-草原之水.png",\
@"Icon-草原木头.png",\
@"Icon-蓝色之眼.png",\
@"Icon-蓝色宝珠.png",\
@"Icon-蓝色宝石.png",\
@"Icon-蛇蜕.png",\
@"Icon-蛤蟆油.png",\
@"Icon-蝙蝠翅膀.png",\
@"Icon-蝴蝶翅膀.png",\
@"Icon-赤光结晶.png",\
@"Icon-转生之辉石.png",\
@"Icon-重金属.png",\
@"Icon-野兽原皮.png",\
@"Icon-金块.png",\
@"Icon-金属碎片.png",\
@"Icon-铁制钉子.png",\
@"Icon-铁矿石.png",\
@"Icon-铜矿石.png",\
@"Icon-银矿石.png",\
@"Icon-镜之石.png",\
@"Icon-闪光树汁.png",\
@"Icon-闪光草.png",\
@"Icon-闪避草.png",\
@"Icon-雨露之丝.png",\
@"Icon-雷鸣珠.png",\
@"Icon-雾灰色铃兰.png",\
@"Icon-霜降肉.png",\
@"Icon-顶级食盐.png",\
@"Icon-顶级鱼腩.png",\
@"Icon-领悟草.png",\
@"Icon-马粪.png",\
@"Icon-魔兽原皮.png",\
@"Icon-魔兽原角.png",\
@"Icon-魔兽原骨.png",\
@"Icon-魔力之土.png",\
@"Icon-魔法树木.png",\
@"Icon-鲨鱼皮.png",\
@"Icon-麻线.png",\
@"Icon-黄色之眼.png",\
@"Icon-黄色宝珠.png",\
@"Icon-黄色宝石.png",\
@"Icon-黄金石.png",\
@"Icon-黄金碎片.png",\
@"Icon-黄金装饰单手剑.png",\
@"Icon-黄金装饰双手剑.png",\
@"Icon-黄金装饰双手杖.png",\
@"Icon-黄金装饰回旋镖.png",\
@"Icon-黄金装饰头盔.png",\
@"Icon-黄金装饰弓.png",\
@"Icon-黄金装饰扇.png",\
@"Icon-黄金装饰护臂.png",\
@"Icon-黄金装饰斧.png",\
@"Icon-黄金装饰棍.png",\
@"Icon-黄金装饰爪.png",\
@"Icon-黄金装饰盾.png",\
@"Icon-黄金装饰矛.png",\
@"Icon-黄金装饰短剑.png",\
@"Icon-黄金装饰短杖.png",\
@"Icon-黄金装饰铠甲上装.png",\
@"Icon-黄金装饰铠甲下装.png",\
@"Icon-黄金装饰锤.png",\
@"Icon-黄金装饰鞋.png",\
@"Icon-黄金装饰鞭.png",\
@"Icon-黑珍珠.png",\
@"Icon-龙的原皮.png",\
@"Icon-龙的原角.png",\
@"Icon-龙的原骨.png"]]

#define MATERIAL_ITEM_PRICE @[@[@"购买价格:320G  出售价格:32G",\
@"购买价格:170G  出售价格:17G",\
@"购买价格:240G  出售价格:48G",\
@"购买价格:310G  出售价格:31G",\
@"购买价格:340G  出售价格:34G",\
@"购买价格:240G  出售价格:24G",\
@"旅行者市场买卖",\
@"购买价格:100G  出售价格:10G",\
@"旅行者市场买卖",\
@"购买价格:110G  出售价格:11G",\
@"购买价格:120G  出售价格:12G",\
@"旅行者市场购买  出售价格:33G",\
@"旅行者市场购买  出售价格:60G",\
@"旅行者市场购买  出售价格:35G",\
@"旅行者市场买卖",\
@"购买价格:1300G  出售价格:130G",\
@"购买价格:220G  出售价格:22G",\
@"旅行者市场购买  出售价格:30G",\
@"旅行者市场购买  出售价格:30G",\
@"旅行者市场购买  出售价格:72G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:31G",\
@"旅行者市场购买  出售价格:26G",\
@"旅行者市场购买  出售价格:21G",\
@"旅行者市场购买  出售价格:40G",\
@"旅行者市场购买  出售价格:26G",\
@"旅行者市场购买  出售价格:38G",\
@"旅行者市场购买  出售价格:110G",\
@"购买价格:210G  出售价格:21G",\
@"旅行者市场购买  出售价格:30G",\
@"购买价格:290G  出售价格:29G",\
@"旅行者市场买卖",\
@"购买价格:1000G  出售价格:100G",\
@"购买价格:100G  出售价格:10G",\
@"购买价格:150G  出售价格:15G",\
@"购买价格:130G  出售价格:13G",\
@"购买价格:250G  出售价格:25G",\
@"旅行者市场购买  出售价格:13G",\
@"购买价格:230G  出售价格:23G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:64G",\
@"购买价格:360G  出售价格:72G",\
@"旅行者市场购买  出售价格:77G",\
@"旅行者市场购买  出售价格:72G",\
@"旅行者市场购买  出售价格:50G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:46G",\
@"旅行者市场买卖",\
@"购买价格:260G  出售价格:26G",\
@"旅行者市场购买  出售价格:27G",\
@"旅行者市场购买  出售价格:18G",\
@"旅行者市场购买  出售价格:600G",\
@"购买价格:270G  出售价格:27G",\
@"旅行者市场购买  出售价格:30G",\
@"购买价格:390G  出售价格:39G",\
@"购买价格:120G  出售价格:24G",\
@"旅行者市场购买  出售价格:64G",\
@"购买价格:60G  出售价格:12G",\
@"旅行者市场购买  出售价格:30G",\
@"旅行者市场购买  出售价格:32G",\
@"购买价格:240G  出售价格:48G",\
@"购买价格:270G  出售价格:27G",\
@"购买价格:160G  出售价格:16G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:68G",\
@"购买价格:240G  出售价格:24G",\
@"购买价格:370G  出售价格:37G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:500G",\
@"旅行者市场购买  出售价格:24G",\
@"旅行者市场购买  出售价格:64G",\
@"购买价格:160G  出售价格:32G",\
@"旅行者市场买卖",\
@"购买价格:230G  出售价格:23G",\
@"购买价格:300G  出售价格:30G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:64G",\
@"旅行者市场买卖",\
@"购买价格:320G  出售价格:32G",\
@"购买价格:220G  出售价格:22G",\
@"旅行者市场买卖",\
@"购买价格:200G  出售价格:20G",\
@"旅行者市场购买  出售价格:1G",\
@"购买价格:210G  出售价格:21G",\
@"旅行者市场购买  出售价格:200G",\
@"旅行者市场购买  出售价格:72G",\
@"购买价格:180G  出售价格:18G",\
@"旅行者市场买卖",\
@"购买价格:160G  出售价格:16G",\
@"购买价格:160G  出售价格:16G",\
@"旅行者市场购买  出售价格:64G",\
@"旅行者市场购买  出售价格:200G",\
@"旅行者市场购买  出售价格:50G",\
@"旅行者市场购买  出售价格:250G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场买卖",\
@"购买价格:120G  出售价格:12G",\
@"购买价格:250G  出售价格:25G",\
@"旅行者市场购买  出售价格:250G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:600G",\
@"购买价格:310G  出售价格:31G",\
@"购买价格:120G  出售价格:24G",\
@"旅行者市场购买  出售价格:30G",\
@"旅行者市场购买  出售价格:250G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:600G",\
@"购买价格:140G  出售价格:14G",\
@"购买价格:160G  出售价格:16G",\
@"旅行者市场购买  出售价格:24G",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:26G",\
@"购买价格:110G  出售价格:11G",\
@"购买价格:180G  出售价格:18G",\
@"购买价格:140G  出售价格:14G",\
@"购买价格:280G  出售价格:28G",\
@"旅行者市场购买  出售价格:250G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:600G",\
@"旅行者市场购买  出售价格:21G",\
@"购买价格:280G  出售价格:28G",\
@"购买价格:240G  出售价格:24G",\
@"购买价格:200G  出售价格:20G",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:26G",\
@"购买价格:120G  出售价格:24G",\
@"旅行者市场购买  出售价格:3000G",\
@"旅行者市场购买  出售价格:400G",\
@"购买价格:100G  出售价格:100G",\
@"购买价格:120G  出售价格:24G",\
@"购买价格:60G  出售价格:12G",\
@"购买价格:240G  出售价格:48G",\
@"旅行者市场购买  出售价格:28G",\
@"购买价格:1000G  出售价格:100G",\
@"购买价格:360G  出售价格:72G",\
@"购买价格:310G  出售价格:31G",\
@"购买价格:1000G  出售价格:100G",\
@"旅行者市场购买  出售价格:135G",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:32G",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"购买价格:270G  出售价格:27G",\
@"旅行者市场购买  出售价格:1G",\
@"旅行者市场购买  出售价格:31G",\
@"旅行者市场购买  出售价格:37G",\
@"旅行者市场购买  出售价格:36G",\
@"购买价格:160G  出售价格:16G",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"购买价格:60G  出售价格:12G",\
@"旅行者市场购买  出售价格:250G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:600G",\
@"旅行者市场购买  出售价格:1000G",\
@"旅行者市场购买  出售价格:300G",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场买卖",\
@"旅行者市场购买  出售价格:200G",\
@"旅行者市场购买  出售价格:48G",\
@"旅行者市场购买  出售价格:56G",\
@"旅行者市场买卖"]]

#endif /* Macros_h */
